{
  "courses": [
    {
      "units": "5 Units",
      "term": "Fall only",
      "description": "Develops elementary spoken Japanese, reading and writing in Kana and Kanji, and the practical skills required to effectively use the modern language. Emphasis on the culture, customs, and traditions of Japan.",
      "id": "CSUS_JAPN 1A",
      "course name": "Elementary Japanese"
    },
    {
      "term": "Spring only",
      "description": ", with emphasis on speaking, vocabulary, reading, grammar, speech patterns, and cultural knowledge. The Kana and Kanji writing systems, geography, and aspects of Japanese customs and manners are included. ",
      "course name": "Elementary Japanese",
      "units": "5 Units",
      "id": "CSUS_JAPN 1B",
      "prerequisite": [
        "JAPN 1A",
        "JAPN 1A"
      ]
    },
    {
      "units": "8 Units",
      "description": " must be able to read and write hiragana and katakana, the two basic phonetic syllabaries.",
      "id": "CSUS_JAPN 1C",
      "prerequisite": [
        "JAPN 1A",
        "JAPN 1B",
        "JAPN 1C"
      ],
      "course name": "Accelerated Elementary Japanese"
    },
    {
      "term": "Fall only",
      "description": "Emphasis on speaking, reading, and grammatical skills through dialogues, discussions, and reading. Meets the Foreign Language Graduation Proficiency Requirement. ",
      "course name": "Intermediate Japanese",
      "units": "4 Units",
      "id": "CSUS_JAPN 2A",
      "prerequisite": [
        "JAPN 1A",
        "JAPN 1B"
      ]
    },
    {
      "term": "Spring only",
      "description": ". Further development of speaking, reading, grammar, and composition skills. Meets the Foreign Language Graduation Proficiency Requirement. ",
      "course name": "Intermediate Japanese",
      "units": "4 Units",
      "id": "CSUS_JAPN 2B",
      "prerequisite": [
        "JAPN 2A",
        "JAPN 2A"
      ]
    },
    {
      "term": "Spring only",
      "description": "Introduction to Japanese literature from the 10th century to the present. The various forms of Japanese classic and contemporary literature will be surveyed through the selective reading of representative works. Class will be conducted in both Japanese and English. ",
      "course name": "Introduction to Japanese Literature",
      "units": "3 Units",
      "id": "CSUS_JAPN 110",
      "prerequisite": [
        "JAPN 2B"
      ]
    },
    {
      "term": "Fall only",
      "description": "Designed to expose advanced students in Japanese to the practical use of modern Japanese. ",
      "course name": "Language and Culture of the Japanese and the Japanese in America",
      "units": "3 Units",
      "id": "CSUS_JAPN 116A",
      "prerequisite": [
        "JAPN 2B"
      ]
    },
    {
      "term": "Spring only",
      "description": " in more advanced modern Japanese. ",
      "course name": "Language and Culture of the Japanese and the Japanese in America",
      "units": "3 Units",
      "id": "CSUS_JAPN 116B",
      "prerequisite": [
        "JAPN 116A",
        "JAPN 116A"
      ]
    },
    {
      "units": "3 Units",
      "term": "Spring only",
      "description": "A broad survey of Japanese civilization from ancient to contemporary times, focusing on the overarching themes of continuity and change. Exploration includes Japanese geography, traditional aesthetics, warrior ethos, rapid modernization, postwar culture, popular culture, among others. Materials drawn predominantly from the fields of literature, film, and history.",
      "id": "CSUS_JAPN 120",
      "course name": "Japanese Civilization"
    },
    {
      "units": "3 Units",
      "term": "Fall, Spring",
      "description": "A survey of major forms of Japanese popular culture from the postwar period to the present with a focus on genre and narrative. Genres include anime, sh¿jo manga, Jpop, popular fiction, and fashion. Among topics to be discussed are common themes, narrative form, global appeal, and fandom. Emphasis on close reading and analysis of the texts/films. No knowledge of Japanese language or culture is required.",
      "id": "CSUS_JAPN 128",
      "course name": "Introduction to Japanese Popular Culture"
    },
    {
      "term": "Fall only",
      "description": "Review of general principles of Japanese grammar and study of advanced grammar and their application in oral and written exercises and projects such as speech, presentations, and translations. ",
      "course name": "Advanced Japanese Grammar, Conversation",
      "units": "3 Units",
      "id": "CSUS_JAPN 150",
      "prerequisite": [
        "JAPN 2B"
      ]
    },
    {
      "units": "1 - 3 Units",
      "term": "Fall, Spring",
      "description": "Directed fieldwork in a project which uses the language skills developed through previous study of Japanese. The projects may include interpreting and translating for public and/or private agencies in Sacramento or other projects approved by the faculty supervisor. All work will be monitored by Sacramento State faculty. The student must submit written reports to his/her supervisor. Can be taken more than once for credit. ",
      "id": "CSUS_JAPN 194",
      "course name": "Field Experience/Internship"
    },
    {
      "units": "1 - 3 Units",
      "term": "Fall, Spring",
      "description": "Tutoring of lower division Japanese students, under the supervision of an instructor. 3 hours of tutoring per week for each unit. ",
      "id": "CSUS_JAPN 195",
      "course name": "Fieldwork -- Tutoring"
    },
    {
      "units": "1 - 3 Units",
      "term": " Departmental petition required. ",
      "description": "Individual projects, or directed reading. Open only to students competent to carry on independent study. ",
      "id": "CSUS_JAPN 199",
      "course name": "Special Problems"
    }
  ],
  "subjectOf": {
    "id": "JAPN",
    "subject": "Japanese"
  },
  "providerOf": {
    "university": "California State University, Sacramento",
    "hasSubject": "Japanese",
    "id": "CSUS"
  }
}