{
  "subjectOf": {
    "id": "HIST",
    "subject": "History"
  },
  "providerOf": {
    "id": "CalPoly",
    "university": "California Polytechnic State University",
    "hasSubject": "History"
  },
  "courses": [
    {
      "id": "CalPoly_HIST 100",
      "course name": "Introduction to the Study of History",
      "units": "2 units",
      "term": [
        "Fall",
        "Winter"
      ],
      "description": "Introduction to the study of history, focusing on methods, topics, skills in the History major at Cal Poly, and internship and career opportunities. To be taken in the first year of study at Cal Poly.",
      "format": "2 seminars."
    },
    {
      "id": "CalPoly_HIST 110",
      "course name": "Western Civilization: Ancient to Renaissance",
      "units": "4 units",
      "term": [
        "Fall",
        "Winter"
      ],
      "description": "Beginnings of western civilization from the river valley societies of the Middle East, circa 3,000 BCE to the Renaissance in Western Europe to 1550 CE. Political, economic, social, intellectual, and artistic development of that period.",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_HIST 111",
      "course name": "Western Civilization: Reformation to the Present",
      "units": "4 units",
      "term": [
        "Winter"
      ],
      "description": "Development of western civilization from 1550 CE to the present. Comparison of liberal modernization of the West with the conservative modernization in Central, East and Southeast Europe. Political, economic, social, intellectual, and artistic developments of that period. Particular attention to understanding dynamics that produce pluralistic mass societies such as Great Britain and France, and authoritarian mass societies such as Nazi Germany and the Soviet Union.",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_HIST 200",
      "course name": "Special Problems for Undergraduates",
      "units": "1-4 units",
      "term": [
        "Fall",
        "Spring"
      ],
      "description": "Individual investigation, research, studies, or surveys of selected problems. Total credit limited to 4 units, with a maximum of 4 units per quarter."
    },
    {
      "id": "CalPoly_HIST 201",
      "course name": "United States History to 1865",
      "units": "4 units",
      "term": [
        "ge area d1; uscp"
      ],
      "description": "Survey of the first half of U.S. history, including : contact and settlement, American Revolution, slavery, westward expansion, early California, Civil War, and California and U.S. Constitutions. Particular attention to how race, class, and gender shaped changing definitions of freedom and equality. Not open to students with credit in HIST206 or HIST207. 4 lectures. Crosslisted as HIST201/HNRS203. Fulfills D1 and USCP."
    },
    {
      "id": "CalPoly_HIST 202",
      "course name": "United States History Since 1865",
      "units": "4 units",
      "term": [
        "ge area d1; uscp"
      ],
      "description": "Survey of the second half of U.S. history, including reconstruction, industrialization, the regulatory state, foreign affairs, and the remaking of citizenship rights and society. Particular attention to how race, class, and gender shaped changing definitions of freedom and equality. Not open to students with credit in HIST206 or HIST207.",
      "format": "4 lectures.",
      "other": "Crosslisted as HIST / HNRS202. Fulfills GE Area D1 and USCP."
    },
    {
      "id": "CalPoly_HIST 206",
      "course name": "American Cultures",
      "units": "4 units",
      "term": [
        "ge area d1; uscp"
      ],
      "description": "The social, cultural, constitutional, and political history of African American, Asian American, Native American, European American, and Latino / a men and women. Not open to students with credit in HIST201 or HIST202. 4 lectures. Fulfills GE D1 and USCP."
    },
    {
      "id": "CalPoly_HIST 207",
      "course name": "Freedom and Equality in American History",
      "units": "4 units",
      "term": [
        "ge area d1; uscp"
      ],
      "description": "The multiple and conflicting ways in which various Americans ( defined in terms of race, class and gender ) have struggled to formulate and promote their own understandings of freedom and equality, from the pre - conquest era to the present. 4 lectures. Not open to students with credit in HIST201 or HIST202.",
      "other": "Crosslisted as HIST / HNRS207. Fulfills GE D1 and USCP."
    },
    {
      "id": "CalPoly_HIST 208",
      "course name": "Survey of California History",
      "units": "4 units",
      "term": [
        "uscp"
      ],
      "description": "Survey of California history from the pre - Columbian period to the present. Native American culture, Spanish imperialism, the Mexican War, gold rush, immigration, dominance of the Southern Pacific Railroad, progressivism, growth of Los Angeles, and California 's impact on national and world economy and politics.",
      "format": "4 lectures.",
      "other": "Fulfills USCP."
    },
    {
      "id": "CalPoly_HIST 210",
      "course name": "World History I",
      "units": "4 units",
      "term": [
        "ge area d3"
      ],
      "description": "Global history from the beginnings of organized agriculture to the Industrial Revolution. Focus on causation, using geography and cultural creation to highlight economic, political, social, and intellectual developments of the major civilizations of earth. Priority given to Liberal Studies majors.",
      "format": "4 lectures.",
      "other": "Fulfills GE D3."
    },
    {
      "id": "CalPoly_HIST 213",
      "course name": "Modern Political Economy",
      "units": "4 units",
      "term": [
        "ge area d2"
      ],
      "description": "The relationship between states and economies in the modern period. Themes of modernization, industrialization, and colonial expansion. The major theories of political economy, especially liberalism and socialism.",
      "format": "4 lectures.",
      "other": "Crosslisted as HIST / HNRS213. Fulfills GE D2."
    },
    {
      "id": "CalPoly_HIST 214",
      "course name": "Political Economy of Latin America and the Middle East",
      "units": "4 units",
      "term": [
        "ge area d2"
      ],
      "description": "Comparative examination of socio - economic structures of the Middle East and Latin America in the framework of global economy. Analysis of the historical context of integration of these two regions in the international economic system and the local reactions to the effects of global forces on national structures.",
      "format": "4 lectures.",
      "other": "Fulfills GE D2."
    },
    {
      "id": "CalPoly_HIST 216",
      "course name": "Comparative Social Movements",
      "units": "4 units",
      "term": [
        "ge area d3"
      ],
      "description": "History of global social movements from the late nineteenth century to the present. May include, but not limited to : socialism, nationalism, feminism, fascism and communism, pacifism, life reform, gay liberation, indigenous peoples ' movements, and environmentalism. Includes a service learning component.",
      "format": "4 lectures.",
      "other": "Crosslisted as HIST / HNRS216. Fulfills GE D3."
    },
    {
      "id": "CalPoly_HIST 221",
      "course name": "World History, Beginnings to 1000",
      "units": "4 units",
      "term": [
        "ge area d3"
      ],
      "description": "History of world societies in comparative global perspective. Cross - cultural exchange, interaction, and conflict in the making of the world to 1000, concentrating on the rise of earliest human communities, growth of states, economic, political, and cultural transformations.",
      "format": "4 lectures.",
      "other": "Fulfills GE D3."
    },
    {
      "id": "CalPoly_HIST 222",
      "course name": "World History, 1000 - 1800",
      "units": "4 units",
      "term": [
        "ge area d3"
      ],
      "description": "History of world societies in comparative global perspective. Cross - cultural exchange, interaction, and conflict in the making of the world to 1800, concentrating on the global interaction and integration, cultural and ecological exchange, economic, political, and cultural transformations.",
      "format": "4 lectures.",
      "other": "Fulfills GE D3."
    },
    {
      "id": "CalPoly_HIST 223",
      "course name": "World History, 1800 - Present",
      "units": "4 units",
      "term": [
        "ge area d3"
      ],
      "description": "Comparative history of Western and non - Western societies in global perspective. Cross - cultural exchange, interaction, and conflict in the making of the modern world, with focus on the economic, political, and cultural transformations that facilitated and emerged from imperialism.",
      "format": "4 lectures.",
      "other": "Crosslisted as HIST / HNRS223. Fulfills GE D3."
    },
    {
      "id": "CalPoly_HIST 225",
      "course name": "The World at War",
      "units": "4 units",
      "term": [
        "ge area d3"
      ],
      "description": "Comparative history of the causes and consequences of global warfare for diverse societies and individuals from prehistory to the present. Topics include the environment, technology, migration, economics, politics, religion, law, ethnicity, class, and gender as they relate to history of global warfare.",
      "format": "4 lectures.",
      "other": "Fulfills GE D3."
    },
    {
      "id": "CalPoly_HIST 270",
      "course name": "Selected Topics",
      "units": "1-4 units",
      "term": [
        "tbd"
      ],
      "description": "Directed group study of selected topics. The Schedule of Classes will list title selected. Total credit",
      "grading": "limited to 8 units. 1 to",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_HIST 303",
      "course name": "Research and Writing Seminar in History",
      "prerequisite": [
        "HIST 100 or History minor"
      ],
      "units": "5 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Designed to develop student 's ability to research and write an interpretive paper on a specific topic. Seminar participants practice the skills of library research, historical and historiographical analysis, and writing and revising. Paper in lieu of final examination. The Schedule of Classes will list topic selected. 4 lectures and research project."
    },
    {
      "id": "CalPoly_HIST 304",
      "course name": "Historiography",
      "prerequisite": [
        "HIST 303"
      ],
      "units": "4 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Theoretical approaches used to study the past, including scholarship on history and memory, the influence of interdisciplinary studies, the significance of race and gender as categories of analysis, and the place of history and the historian in contemporary society. 3 seminar meetings and research project."
    },
    {
      "id": "CalPoly_HIST 306",
      "course name": "The Witch-Hunts in Europe, 1400-1800",
      "units": "4 units",
      "term": [
        "ge area d5"
      ],
      "description": "A history of the development of witchcraft ideas, persecutions, and skepticism in the western world from",
      "grading": "1400 to 1800,"
    },
    {
      "id": "CalPoly_HIST 307",
      "course name": "European Thought 1800-2000",
      "units": "4 units",
      "term": [
        "ge area d5"
      ],
      "description": "Intellectual and cultural history of Europe from the nineteenth century to the present. Liberalism, radical thought, feminism, evolutionary theory, psycho - analysis, structuralism, existentialism, and postmodernism. 4 lectures. Fulfills GE D5 except for History majors."
    },
    {
      "id": "CalPoly_HIST 308",
      "course name": "The Trans-Atlantic Slave Trade",
      "units": "4 units",
      "term": [
        "ge area d5"
      ],
      "description": "The African, Islam and Euro - American dimensions of the trans - Atlantic slave trade, with focus on its varying roots, organization and impact on cross - cultural and global levels. 4 lectures. Fulfills GE D5 except for History majors."
    },
    {
      "id": "CalPoly_HIST 309",
      "course name": "Cultures of West Africa and the African Diaspora",
      "units": "4 units",
      "term": [
        "ge area d5"
      ],
      "description": "The cultures of West African and the African Diaspora, with special attention to the intersection of Animist, Islamic and Western cultures, and the survival of African cultures in the Americas as manifested in the artistic, religious, literary, and other humanistic legacies of the African Diaspora. 4 lectures. Fulfills GE D5 except for History majors."
    },
    {
      "id": "CalPoly_HIST 310",
      "course name": "East Asian Culture and Civilization",
      "units": "4 units",
      "term": [
        "ge area d5"
      ],
      "description": "The pre - modern and modern histories of China and Japan. Focus on the traditional era, the transition to modernity, cultural uniqueness within East Asian civilization, and western images of Asia. 4 lectures. Crosslisted as HIST310/HNRS312. Fulfills GE D5 except for History majors."
    },
    {
      "id": "CalPoly_HIST 314",
      "course name": "Middle East",
      "units": "4 units",
      "term": [
        "Winter"
      ],
      "description": "Political, social, and economic development of the Middle Eastern countries in the context of regional history and international politics since the birth of Islam. Particular attention to the resurgence of religious movements and their connection with nationalism and anti - colonialism in the region. 3 lectures and research project."
    },
    {
      "id": "CalPoly_HIST 316",
      "course name": "Modern East Asia",
      "units": "4 units",
      "term": [
        "ge area d5"
      ],
      "description": "Modern histories of China, Japan and Korea : great disruptions of modernity that have transformed these societies, common characteristics of modernity in East Asia, great differences between Chinese, Japanese and Korean histories, and the mutually constitutive nature of these East Asian histories. 4 lectures. Fulfills GE D5 except for History majors."
    },
    {
      "id": "CalPoly_HIST 317",
      "course name": "The Lure of the Sea",
      "units": "4 units",
      "term": [
        "ge area d5"
      ],
      "description": "The history of the sea, people who travel across it, live alongside or in the midst of it, or simply seek it out. Topics include imperialism, maritime commerce, port cities, littoral societies, piracy, tourism, popular culture. 4 lectures. Crosslisted as HIST / HNRS317. Fulfills GE D5 except for History majors."
    },
    {
      "id": "CalPoly_HIST 318",
      "course name": "The City in the Modern World",
      "units": "4 units",
      "term": [
        "ge area d5"
      ],
      "description": "Comparative history of social, economic, political, and cultural changes in urban life during the nineteenth and twentieth centuries. Topics may include but are not limited to : commerce and labor ; disease and death ; conservation and preservation ; gender and sexuality ; race and ethnicity. 4 lectures. Fulfills GE D5 except for History majors."
    },
    {
      "id": "CalPoly_HIST 319",
      "course name": "Modern South and Southeast Asia",
      "units": "4 units",
      "term": [
        "ge area d5"
      ],
      "description": "Modern histories of South and Southeast Asia : traditional empires and cultures, spread of modern capitalism, Western and Japanese colonialism, decolonization and independence, ethnic and religious tensions, roles in contemporary economy and geopolitics. 4 lectures. Fulfills GE D5 except for History majors."
    },
    {
      "id": "CalPoly_HIST 320",
      "course name": "Colonial and Revolutionary America",
      "units": "4 units",
      "term": [
        "ge area d5"
      ],
      "description": "Settlement and evolution of British America, background to the imperial dispute, events leading to the Revolution, Articles of Confederation, Constitution, the national economy, roles of and impact on African - Americans, women, Native Americans and Loyalists. 4 lectures. Fulfills GE D5 except for History majors."
    },
    {
      "id": "CalPoly_HIST 321",
      "course name": "Civil War America",
      "units": "4 units",
      "term": [
        "ge area d5"
      ],
      "description": "The experiences of nineteenth - century Americans. Focus on industrialization, antebellum reform, slavery, the Civil War battlefield and homefront, Reconstruction, and the creation of a New South. 4 lectures. Fulfills GE D5 except for History majors."
    },
    {
      "id": "CalPoly_HIST 322",
      "course name": "Modern America",
      "units": "4 units",
      "term": [
        "ge area d5"
      ],
      "description": "American history since 1900. Focus on domestic and foreign policy interactions, struggle of disenfranchised groups for social and political equality, and changes in culture and identity. 4 lectures. Crosslisted as HIST322/HNRS323. Fulfills GE D5 except for History majors."
    },
    {
      "id": "CalPoly_HIST 324",
      "course name": "The Historical Novel in the United States, 1960s to the Present",
      "units": "4 units",
      "term": [
        "ge area d5"
      ],
      "description": "An introduction to the historical novel as it has developed in the United States since the 1960s. Exploration of how historical novels typically represent the past and the ways in which they change our notion of what counts as ' history. ' 4 lectures. Crosslisted as HIST / HNRS324. Fulfills GE D5 except for History majors."
    },
    {
      "id": "CalPoly_HIST 326",
      "course name": "United States Foreign Relations since 1898",
      "units": "4 units",
      "term": [
        "ge area d5"
      ],
      "description": "Topics include imperialism, the world wars, the Cold War, decolonization, and globalization. Particular attention to ideologies shaping U.S. policy ; ethics and decision - making at multiple levels ; and political, economic, social, and cultural consequences of U.S. activity for societies and individuals around the world. 4 lectures. Fulfills GE D5 except for History majors."
    },
    {
      "id": "CalPoly_HIST 334",
      "course name": "Modern Europe, 1789-1914",
      "units": "4 units",
      "term": [
        "ge area d5"
      ],
      "description": "Europe 's ' long nineteenth century ' reveals continuity and dramatic changes in politics, social structures and identities, forms of cultural expression, and scientific and technological knowledge. Topics include the French and Industrial revolutions ; liberalism ; nationalism ; socialism ; modernism ; imperialism ; and World War I. 4 lectures. Crosslisted as HIST / HNRS334. Fulfills GE D5 except for History majors."
    },
    {
      "id": "CalPoly_HIST 335",
      "course name": "Modern Europe, 1914-Present",
      "units": "4 units",
      "term": [
        "ge area d5"
      ],
      "description": "Examination of twentieth - century European history. Topics include : First World War, World Economic Crisis, communism, fascism, mass culture, shifting gender roles, Second World War, Cold War, Velvet Revolution, and the European Union. 4 lectures. Crosslisted as HIST / HNRS335. Fulfills GE D5 except for History majors."
    },
    {
      "id": "CalPoly_HIST 336",
      "course name": "Britain at War: The British, the Americans and the Struggle for Freedom, 1939-1945",
      "units": "4 units",
      "term": [
        "ge area d5"
      ],
      "description": "Historical examination of Great Britain 's challenge to its sovereignty and freedom by the regime of Nazi",
      "grading": "Germany from 1939 -",
      "format": "1945"
    },
    {
      "id": "CalPoly_HIST 337",
      "course name": "Colonial Latin America",
      "units": "4 units",
      "term": [
        "ge area d5"
      ],
      "description": "Survey of Latin American history in the colonial period from 1492 to the early nineteenth century. Special attention to the indigenous cultures, the Iberian civilization, and the evolving relationship between them. 4 lectures. Fulfills GE D5 except for History majors.",
      "other": "Formerly HIST 339."
    },
    {
      "id": "CalPoly_HIST 338",
      "course name": "Modern Latin America",
      "units": "4 units",
      "term": [
        "ge area d5"
      ],
      "description": "Social, economic and political history of Latin America from the 19th century to the present. Historical development of economic structures and political and cultural institutions in the region, including Central America, the Hispanic Caribbean, and South America. 4 lectures. Fulfills GE D5 except for History majors.",
      "other": "Formerly HIST 340."
    },
    {
      "id": "CalPoly_HIST 341",
      "course name": "Modern Central America",
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "Political, social, and economic development of Central American countries in the context of regional history and international politics during the nineteenth and twentieth Centuries. 3 lectures and research project."
    },
    {
      "id": "CalPoly_HIST 350",
      "course name": "The Scientific Revolution, c",
      "units": "4 units",
      "term": [
        "ge area d5"
      ],
      "description": "History of the intellectual, social, and cultural changes in the early modern period known as the ' Scientific Revolution. ' Main topics include the Copernican Revolution, mechanical philosophy, natural history, and the social and material practices of early modern science. 4 lectures. Crosslisted as HIST / HNRS350. Fulfills GE D5 except for History majors."
    },
    {
      "id": "CalPoly_HIST 354",
      "course name": "History of Network Technology",
      "units": "4 units",
      "term": [
        "ge area Fall"
      ],
      "description": "History of computer network technology from the Cold War to the present. Origins of the Internet, development of TCP / IP, growth of network democracy, encryption, race and gender in cyberspace, Usenet and hypertext.",
      "format": "4 lectures.",
      "other": "Fulfills GE Area F."
    },
    {
      "id": "CalPoly_HIST 359",
      "course name": "Living in a Material World",
      "units": "4 units",
      "term": [
        "ge area Fall"
      ],
      "description": "Evolution of materials ( ceramics, metals, polymers, composites, semiconductors ) in the context of history. Traces the link between historical and technological developments enabled by materials from the Stone Age to the Electronic Age. 4 lectures. Crosslisted as HIST / MATE359.",
      "other": "Fulfills GE Area F."
    },
    {
      "id": "CalPoly_HIST 400",
      "course name": "Special Problems for Advanced Undergraduates",
      "units": "1-4 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Individual investigation, research, studies, or surveys of selected problems. Total credit limited to 4 units, with a maximum of 4 units per quarter."
    },
    {
      "id": "CalPoly_HIST 401",
      "course name": "Early America",
      "prerequisite": [
        "HIST 303 or graduate st"
      ],
      "units": "4 units",
      "term": [
        "Winter"
      ],
      "description": "Age of exploration. European powers in eastern North America. English settlements, development of the English colonies, with emphasis on Virginia and Massachusetts. Proprietary interests, growth of internal control, and colonial conflicts. 3 lectures and research project."
    },
    {
      "id": "CalPoly_HIST 402",
      "course name": "American Revolution and the New Nation",
      "prerequisite": [
        "HIST 303 or graduate st"
      ],
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "Background to the imperial dispute, events leading to the Revolution, Articles of Confederation, Constitution, impact on the national economy, women, African - Americans, Loyalists, Native Americans. The Schedule of Classes will list topic selected. 3 lectures and research project."
    },
    {
      "id": "CalPoly_HIST 405",
      "course name": "African-American History to 1865",
      "prerequisite": [
        "HIST 303 or graduate st"
      ],
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "History of African Americans from the colonial period to the Civil War",
      "grading": ", roughly 1619 -",
      "format": "1865"
    },
    {
      "id": "CalPoly_HIST 406",
      "course name": "African-American History from 1865",
      "prerequisite": [
        "HIST 303 or graduate st"
      ],
      "units": "4 units",
      "term": [
        "uscp"
      ],
      "description": "History of African - Americans from the Civil War to the present. Reconstruction, racial segregation, the Harlem Renaissance, the Great Migration, the Civil Rights Movement, Black Feminism and Black Power. 3 lectures and research project. Fulfills USCP."
    },
    {
      "id": "CalPoly_HIST 407",
      "course name": "Science and Society in Cold War America",
      "prerequisite": [
        "HIST 303",
        "ISLA 123"
      ],
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "American science during the Cold War, including the development of weapons - related technologies, the effects of economic change and foreign policy, ethical debates among scientists, and shifting public perceptions of science. 3 lectures and research project."
    },
    {
      "id": "CalPoly_HIST 408",
      "course name": "The Age of Roosevelt: Depression and World War, 1929-50",
      "prerequisite": [
        "HIST 303 or graduate st"
      ],
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "Principle forces affecting the nation 's political, social and economic life during the Age of Franklin Roosevelt. Included are the politics of the New Deal, government regulation of the economy and response to the Depression, the rise of the modern presidency, racial and ethnic conflict, the politics of class and gender, the home front at war and post - war tension. 3 lectures and research project."
    },
    {
      "id": "CalPoly_HIST 409",
      "course name": "Vietnam War at Home and Abroad",
      "prerequisite": [
        "HIST 303 or graduate st"
      ],
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "Interaction of revolutionary Vietnamese nationalism with U.S. foreign policy. Analysis of the conduct of the war. Assessment of the impact of the war on U.S. society. 3 lectures and research project."
    },
    {
      "id": "CalPoly_HIST 413",
      "course name": "Turbulent Decades: The United States in the 1960s and 1970s",
      "prerequisite": [
        "HIST 303 or graduate st"
      ],
      "units": "4 units",
      "term": [
        "Spring"
      ],
      "description": "Topics include liberalism, conservatism, civil rights, foreign policy, the war in Vietnam, stagflation and deregulation, and key social and cultural movements. Emphasis on politics, economic conditions, and ideology. 3 lectures and research project."
    },
    {
      "id": "CalPoly_HIST 416",
      "course name": "Modern Japan",
      "prerequisite": [
        "HIST 303 or completion of GE Area D5"
      ],
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "Japan 's development as a modern state (",
      "grading": "1800 - 2000 CE"
    },
    {
      "id": "CalPoly_HIST 417",
      "course name": "20th Century China",
      "prerequisite": [
        "HIST 303 or completion of GE Area D5"
      ],
      "units": "4 units",
      "term": [
        "Fall"
      ],
      "description": "Chinese history in the twentieth century : the fall of the Qing Dynasty and founding of Republic of China in 1912, problems of imperialism and modernity, Chinese Communist Party and People 's Republic of",
      "grading": "China since 1949.",
      "format": "3"
    },
    {
      "id": "CalPoly_HIST 418",
      "course name": "Chinese Film and History",
      "prerequisite": [
        "HIST 303 or completion of GE Area D5"
      ],
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "Examination of 20th century Chinese history through the use of Chinese feature films. Films ( with English subtitles ) serve as main texts for understanding the tremendous changes in modern Chinese history, and the evolving relationships between film and Chinese society.",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_HIST 419",
      "course name": "Modern Southeast Asia",
      "prerequisite": [
        "HIST 303 or completion of GE Area D5"
      ],
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "Modern history of mainland and maritime Southeast Asia, focusing on the development of political institutions and changing political and cultural identities. Early empires, expansion of capitalism, colonial rule and wars through era of independence. 3 lectures and research project."
    },
    {
      "id": "CalPoly_HIST 421",
      "course name": "The History of Prostitution",
      "prerequisite": [
        "HIST 303"
      ],
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "Comparative history of prostitution from antiquity to present. Analysis of prostitution from social, cultural, political, gendered and economic perspectives. 4 lectures. Crosslisted as HIST / WGS421."
    },
    {
      "id": "CalPoly_HIST 422",
      "course name": "Japanese Postwar Film and History",
      "prerequisite": [
        "HIST 303 or completion of GE Area D5"
      ],
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "Relationships between film and postwar Japanese society ; recurring themes and images that link the diverse body of postwar Japanese film. Films ( with English subtitles ) serve as main texts for understanding of the tremendous changes in recent Japanese history.",
      "format": "3 lectures, 1 activity."
    },
    {
      "id": "CalPoly_HIST 423",
      "course name": "The History of Vietnam",
      "prerequisite": [
        "HIST 303 or completion of GE Area D5"
      ],
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "The history of Vietnam and the influences on its national identities, including migration, cultural adaptations, temporality and territoriality, foreign influences, and racial formations within and outside of the borders of today 's Vietnam. 3 lectures and research project."
    },
    {
      "id": "CalPoly_HIST 424",
      "course name": "Organizing and Teaching History",
      "units": "4 units",
      "term": [
        "Fall"
      ],
      "description": "Organization, selection, presentation, application, and interpretation of subject matter in history in secondary schools.",
      "format": "4 seminars."
    },
    {
      "id": "CalPoly_HIST 425",
      "course name": "History-Social Sciences Student Teaching Seminar",
      "prerequisite": [
        "HIST 424"
      ],
      "units": "2 units",
      "term": [
        "cr/nc"
      ],
      "description": "Supervised practicum for part - time and full - time student teachers in the Social Science Credential Program. Teaching techniques and strategies useful for addressing a wide range of issues that arise",
      "grading": "in grades 6 -",
      "format": "12"
    },
    {
      "id": "CalPoly_HIST 426",
      "course name": "Imperial Russia",
      "prerequisite": [
        "HIST 303 or graduate st"
      ],
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "Political, social, intellectual and economic roots of Russian Absolutism. Emergence of Russia as an imperial power, reform, reaction and revolution -",
      "format": "1689 - 1914. 3"
    },
    {
      "id": "CalPoly_HIST 427",
      "course name": "Soviet Russia",
      "prerequisite": [
        "HIST 303 or graduate st"
      ],
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "Transformation of Russian autocracy from tsarist to Bolshevik under the impact of World War I and the Revolution of 1917. The formative force of Marxism - Leninism ; Civil War ; the ' experimental ' 20s ; forced collectivization and industrialization ; the Purges ; ' engineering ' a new Soviet Woman and Man for a new communist world ; War : Second and Cold. 3 lectures and research project."
    },
    {
      "id": "CalPoly_HIST 428",
      "course name": "The Indian Ocean",
      "prerequisite": [
        "HIST 303 or graduate st"
      ],
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "History of the Indian Ocean from pre - Islamic times to the present. Exploration of unity and diversity of interconnected societies of the sea and shores of the Indian Ocean. Examination of geography, trade, travel, naval power and exploration in the political, religious, cultural, maritime and economic history of this vital region.",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_HIST 429",
      "course name": "Precolonial African History",
      "prerequisite": [
        "HIST 303 or graduate st"
      ],
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "Survey of African history from earliest times. Ancient African civilizations, Moslem penetration, the rise of indigenous kingdoms and the continuous impact of Atlantic slave trade. 3 lectures and research project."
    },
    {
      "id": "CalPoly_HIST 430",
      "course name": "Modern African History",
      "prerequisite": [
        "HIST 303 or graduate st"
      ],
      "units": "4 units",
      "term": [
        "Spring"
      ],
      "description": "Survey of African history in the 19th and 20th centuries including European colonialism, African resistance, the rise of African nationalism and problems since independence. 3 lectures and research project."
    },
    {
      "id": "CalPoly_HIST 432",
      "course name": "United States Environmental History",
      "prerequisite": [
        "HIST 303 or graduate st"
      ],
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "Consideration of major themes in human interactions with the environment from the colonial period to the present. Major topics include : changing subsistence systems ; the environmental impact of industrialization ; conservation and sustainability ; and the rise of modern environmental movements. 3 lectures and a research project."
    },
    {
      "id": "CalPoly_HIST 433",
      "course name": "History of the American West, Southwest Borderlands, and California",
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "Historiographical and chronological survey since European contact. Emphasis on the frontier and borderlands concepts, Native America, the Hispanic Southwest, US expansion and conquest, industrial capitalism, inter - societal and transnational economies, immigration, public memory, and racial identity formation. 3 lectures and a research project."
    },
    {
      "id": "CalPoly_HIST 434",
      "course name": "American Women's History to 1870",
      "prerequisite": [
        "HIST 303 or completion of GE Area D5"
      ],
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "Female ideology and experience from the colonial period through the American Civil War. Use of a variety of sources, including women 's own writing, in order to understand the history of women as it both reflects and shapes American culture and society. 3 lectures and research project. Crosslisted as HIST / WGS434."
    },
    {
      "id": "CalPoly_HIST 435",
      "course name": "American Women's History from 1870",
      "prerequisite": [
        "HIST 303 or completion of GE Area D5"
      ],
      "units": "4 units",
      "term": [
        "uscp"
      ],
      "description": "The female past in the modern period of U.S. history. Considers how transformations in gender roles are reflective of other significant changes in American culture and society. Emphasis on class, race, and ethnic variations in women 's experience. 3 lectures and research project. Crosslisted as HIST / WGS435. Fulfills USCP."
    },
    {
      "id": "CalPoly_HIST 437",
      "course name": "Nazi Germany",
      "prerequisite": [
        "HIST 303 or graduate st"
      ],
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "Background of German Romantic Nationalism ; national unification and defeat in World War I ; the failure of Weimar Democracy and political radicalization ; the Nazi political, economic, and social revolution",
      "format": "1933 - 1939. 3"
    },
    {
      "id": "CalPoly_HIST 440",
      "course name": "Topics and Issues in the History of the United States",
      "prerequisite": [
        "HIST 303 or graduate st"
      ],
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "Selected topics and issues in United States history. Descriptive subtitles assigned to each course. The Schedule of Classes will list topic selected. May be",
      "grading": "repeated to 8 units."
    },
    {
      "id": "CalPoly_HIST 441",
      "course name": "Topics and Issues in European History",
      "prerequisite": [
        "HIST 303 or graduate st"
      ],
      "units": "4 units",
      "term": [
        "Winter"
      ],
      "description": "Selected topics and issues in European history. Descriptive subtitles assigned to each course. The Schedule of Classes will list topic selected. May be",
      "grading": "repeated to 8 units."
    },
    {
      "id": "CalPoly_HIST 442",
      "course name": "Topics and Issues in Latin American History",
      "prerequisite": [
        "HIST 303 or graduate st"
      ],
      "units": "4 units",
      "term": [
        "Fall"
      ],
      "description": "Selected topics and issues in Latin American history. Descriptive subtitles will be assigned to each course. The Schedule of Classes will list topic selected. May be",
      "grading": "repeated to 8 units."
    },
    {
      "id": "CalPoly_HIST 443",
      "course name": "Topics and Issues in Asian History",
      "prerequisite": [
        "HIST 303 or completion of GE Area D5 or graduate st"
      ],
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "Selected topics and issues in Asian history. Descriptive subtitles will be assigned to each course. The Schedule of Classes will list topic selected. May be",
      "grading": "repeated to 8 units."
    },
    {
      "id": "CalPoly_HIST 444",
      "course name": "Topics and Issues in African History",
      "prerequisite": [
        "HIST 303 or graduate st"
      ],
      "units": "4 units",
      "term": [
        "Fall"
      ],
      "description": "Selected topics and issues in African history. Descriptive subtitles will be assigned to each course. The Schedule of Classes will list topic selected. May be",
      "grading": "repeated to 8 units."
    },
    {
      "id": "CalPoly_HIST 445",
      "course name": "Topics and Issues in Comparative History",
      "prerequisite": [
        "HIST 303 or graduate st"
      ],
      "units": "4 units",
      "term": [
        "Fall"
      ],
      "description": "Selected topics and issues in comparative history. Descriptive subtitles will be assigned to each course. The Schedule of Classes will list topic selected. May be",
      "grading": "repeated to 8 units."
    },
    {
      "id": "CalPoly_HIST 452",
      "course name": "Renaissance and Reformation Europe",
      "prerequisite": [
        "HIST 303 or graduate st"
      ],
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "<grading> Europe from 1348 to 1620 CE </grading> , with topics including the urban milieu, Renaissance philosophy and artistic expression, the new prince, the educational revolution, the Renaissance Church, Martin Luther, Jean Calvin, and the monumental economic, social, and political changes of the sixteenth century. 3 lectures and research project.",
      "grading": "Europe from 1348 to 1620 CE"
    },
    {
      "id": "CalPoly_HIST 453",
      "course name": "Religious Wars and Absolutism",
      "prerequisite": [
        "HIST 303 or graduate st"
      ],
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "<grading> Europe from 1559 to 1715 CE </grading> , focusing on the Catholic - Protestant conflict, the rise of the Absolutist state ( especially Louis XIV ), the ' Crisis of the Seventeenth Century, ' the Thirty Years War, the English Civil War and Cromwell, and the Newtonian Paradigm. 3 lectures and research project.",
      "grading": "Europe from 1559 to 1715 CE"
    },
    {
      "id": "CalPoly_HIST 458",
      "course name": "Gender and Sexuality in Modern Europe",
      "prerequisite": [
        "HIST 303 or completion of GE Area D5"
      ],
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "Social, economic, political, and cultural effects of changing gender systems in modern Europe, particularly but not exclusively with regard to sex and sexuality. 3 lectures and research project. Crosslisted as HIST / WGS458."
    },
    {
      "id": "CalPoly_HIST 459",
      "course name": "Imperialism and Postcolonial Studies",
      "prerequisite": [
        "HIST 303 or completion of GE Area D5"
      ],
      "units": "4 units",
      "term": [
        "Winter"
      ],
      "description": "The history of imperialism and postcolonial studies and the influences of social, economic, and political impact of the empire system on indigenous people, cultures, economy, and politics. 3 lectures and research project."
    },
    {
      "id": "CalPoly_HIST 460",
      "course name": "Senior Project I",
      "prerequisite": [
        "HIST 303",
        "HIST 304"
      ],
      "units": "2 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Completion of paper or creative project under faculty supervision. Must be historical in nature, investigate a question of significance, include an historiographical analysis, and make an argument based on primary and secondary sources. Take HIST461 during a subsequent quarter."
    },
    {
      "id": "CalPoly_HIST 461",
      "course name": "Senior Project II",
      "prerequisite": [
        "HIST 303",
        "HIST 304",
        "HIST 460"
      ],
      "units": "2 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Completion of paper or creative project begun in HIST460 under faculty supervision."
    },
    {
      "id": "CalPoly_HIST 467",
      "course name": "History Internship",
      "units": "4-12 units",
      "term": [
        "cr/nc"
      ],
      "description": "Supervised work experience using skills of the discipline of history in a public agency",
      "grading": "ranging from 12 to 36 hours per"
    },
    {
      "id": "CalPoly_HIST 470",
      "course name": "Selected Advanced Topics",
      "prerequisite": [
        "HIST 303 or graduate st"
      ],
      "units": "1-4 units",
      "term": [
        "tbd"
      ],
      "description": "Directed group study of selected topics for advanced students. Open to undergraduate and graduate students. Class Schedule will list topic selected. Total credit",
      "grading": "limited to 8 units. 1 to",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_HIST 475",
      "course name": "Arabia and the Arab Gulf States",
      "prerequisite": [
        "HIST 303 or graduate st"
      ],
      "units": "4 units",
      "term": [
        "Spring"
      ],
      "description": "History of Arabia from pre - Islamic times to the present. Political, cultural, social and economic history of Oman, the United Arab Emirates, Qatar, Bahrain, Kuwait, Saudi Arabia and Yemen. Emphasis on regional connectivity, imperialism and the origins of modern Gulf nation states, and historical roots to contemporary problems in the region.",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_HIST 485",
      "course name": "Cooperative Education Experience",
      "units": "6 units",
      "term": [
        "cr/nc"
      ],
      "description": "Part - time work experience in business, industry, government, and other areas of student career interest. Positions are paid and usually require relocation and registration in course for two consecutive quarters. Formal report and evaluation by work supervisor required. No major credit allowed ; total credit limited to 12 units. Credit / No Credit grading only."
    },
    {
      "id": "CalPoly_HIST 495",
      "course name": "Cooperative Education Experience",
      "units": "12 units",
      "term": [
        "cr/nc"
      ],
      "description": "Full - time work experience in business, industry, government, and other areas of student career interest. Positions are paid and usually require relocation and registration in course for two consecutive quarters. Formal report and evaluation by work supervisor required. No major credit allowed ; total credit limited to 24 units. Credit / No Credit grading only."
    },
    {
      "id": "CalPoly_HIST 500",
      "course name": "Special Problems for Graduate Students",
      "units": "1-4 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Individual investigation, research, studies, or surveys of selected problems. Total credit",
      "grading": "limited to 8 units"
    },
    {
      "id": "CalPoly_HIST 504",
      "course name": "Graduate Study in History",
      "units": "4 units",
      "term": [
        "Winter"
      ],
      "description": "Weekly reading and discussion course on practical methods and theoretical approaches to the study and writing of history.",
      "format": "4 seminars."
    },
    {
      "id": "CalPoly_HIST 505",
      "course name": "Graduate Seminar in United States History",
      "units": "4 units",
      "term": [
        "Fall"
      ],
      "description": "Intensive study of selected topics in United States history. The Schedule of Classes will list topic selected. Total credit",
      "grading": "limited to 12 units.",
      "format": "4 seminars."
    },
    {
      "id": "CalPoly_HIST 506",
      "course name": "Graduate Seminar in European History",
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "Intensive study of selected topics in modern European history. The Schedule of Classes will list topic selected. Total credit",
      "grading": "limited to 12 units.",
      "format": "4 seminars."
    },
    {
      "id": "CalPoly_HIST 507",
      "course name": "Graduate Seminar in East Asian History",
      "units": "4 units",
      "term": [
        "Spring"
      ],
      "description": "Intensive study of selected topics in East Asian history. The Schedule of Classes will list topic selected. Total credit",
      "grading": "limited to 12 units.",
      "format": "4 seminars."
    },
    {
      "id": "CalPoly_HIST 508",
      "course name": "Graduate Seminar in Latin American History",
      "units": "4 units",
      "term": [
        "Winter"
      ],
      "description": "Intensive study of selected topics in Latin American history. The Schedule of Classes will list topic selected. Total credit",
      "grading": "limited to 12 units.",
      "format": "4 seminars."
    },
    {
      "id": "CalPoly_HIST 509",
      "course name": "Graduate Seminar in African History",
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "Intensive study of selected topics in African history. The Schedule of Classes will list topic selected. Total credit",
      "grading": "limited to 12 units.",
      "format": "4 seminars."
    },
    {
      "id": "CalPoly_HIST 510",
      "course name": "Graduate Seminar in Comparative History",
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "Intensive study of selective topics in comparative history. The Schedule of Classes will list topic selected. Total credit",
      "grading": "limited to 12 units.",
      "format": "4 seminars."
    },
    {
      "id": "CalPoly_HIST 512",
      "course name": "Supervised Reading for Comprehensive Exams",
      "prerequisite": [
        "HIST 504"
      ],
      "units": "2 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Directed supervision of reading for MA comprehensive exams. Regular consultation between advisor and student. Total credit",
      "grading": "limited to 4 units"
    },
    {
      "id": "CalPoly_HIST 570",
      "course name": "Selected Advanced Topics",
      "units": "1-4 units",
      "term": [
        "tbd"
      ],
      "description": "Directed group study of selected topics for graduate students. Open to undergraduate and graduate students. The Schedule of Classes will list title selected. Total credit",
      "grading": "limited to 8 units",
      "format": ". 1 - 4 lectures."
    },
    {
      "id": "CalPoly_HIST 599",
      "course name": "Thesis",
      "units": "3 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Directed supervision of MA thesis. Regular consultation between advisor and student. Course to be taken three times over three separate quarters ; total credit",
      "grading": "limited to 9 units"
    }
  ]
}