{
  "subjectOf": {
    "id": "EDES",
    "subject": "Environmental Design"
  },
  "providerOf": {
    "id": "CalPoly",
    "university": "California Polytechnic State University",
    "hasSubject": "Environmental Design"
  },
  "courses": [
    {
      "id": "CalPoly_EDES 101",
      "course name": "Introduction to Architecture and Environmental Design",
      "units": "2 units",
      "term": [
        "tbd"
      ],
      "description": "Familiarization with the professional fields of architecture, landscape architecture, structural engineering, construction, and city planning. Introduction to the college 's programs as they relate to individual aptitudes. The design process. Visiting speakers.",
      "format": "2 lectures."
    },
    {
      "id": "CalPoly_EDES 123",
      "course name": "Principles of Environmental Design",
      "units": "4 units",
      "term": [
        "ge area d4"
      ],
      "description": "Introduction to the individual 's and societal relation with the designed and built environment, and its impact on natural resource consumption, identity, behavior, community, and human health, safety, and general well - being. Study of the individual and role of design in community development and in making and preserving culture. Diverse perspectives including designers, engineers, governing bodies, and individual users.",
      "format": "2 lectures, 2 discussions.",
      "other": "Fulfills GE D4."
    },
    {
      "id": "CalPoly_EDES 333",
      "course name": "Professional Presentations",
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "Skills and tools for employment acquisition or graduate school admissions. Individual resume design and production. Documentation of personal, professional and academic experience via written, oral and image based systems. Employment interview dynamics. Electronic and hardcopy portfolio production. Internet marketing.",
      "format": "1 lecture, 3 activities."
    },
    {
      "id": "CalPoly_EDES 350",
      "course name": "The Global Environment",
      "units": "4 units",
      "term": [
        "ge area Fall"
      ],
      "description": "Interdisciplinary investigation of how human activities impact the Earth 's environment on a global scale. Examination of population, resource use, climate change, and biodiversity from scientific / technical and social / economic/ historical / political perspectives. Use of remote sensing maps. Sustainable solutions. 4 lectures.",
      "other": "Crosslisted as AG / EDES / ENGR / GEOG / ISLA / SCM / UNIV350. Fulfills GE Area F."
    },
    {
      "id": "CalPoly_EDES 406",
      "course name": "Sustainable Environments",
      "units": "4 units",
      "term": [
        "Fall"
      ],
      "description": "Collaboration of interdisciplinary faculty and guest speakers / panelists. Introduction, illustration and analysis of concepts and principles for sustainability to be used in all aspects of environmental design. Integration and application of knowledge of human and natural systems with environmental, social and economic concerns, from a global - to - local perspective.",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_EDES 408",
      "course name": "Implementing Sustainable Principles",
      "prerequisite": [
        "EDES 406"
      ],
      "units": "4 units",
      "term": [
        "Winter",
        "Spring"
      ],
      "description": "A primarily project - based course, intended to aid students who wish to collaborate with the purpose of implementing sustainability principles by developing tools, process or designs, for community - based projects and proposals at various scales of planning, architecture and design of the human environment to address social, environmental and economic issues.",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_EDES 410",
      "course name": "Advanced Implementation of Sustainable Principles",
      "prerequisite": [
        "EDES 408"
      ],
      "units": "4 units",
      "term": [
        "Winter",
        "Spring"
      ],
      "description": "Advanced continuation of community - based projects defined and initiated in EDES408. Ongoing projects, individual and group, address variable scales of planning, architecture, and environmental design, with required completion at the end of the course. 2 seminars and supervised work."
    }
  ]
}