{
  "subjectOf": {
    "id": "ME",
    "subject": "Mechanical Engineering"
  },
  "providerOf": {
    "id": "CalPoly",
    "university": "California Polytechnic State University",
    "hasSubject": "Mechanical Engineering"
  },
  "courses": [
    {
      "id": "CalPoly_ME 128",
      "course name": "Introduction to Mechanical Engineering I",
      "units": "1 unit",
      "term": [
        "Fall"
      ],
      "description": "Introduction to mechanical engineering and its application in professional practice. Includes design, analysis, testing and dissection of mechanical engineering systems, from simple machines to more complicated systems. Introduction to engineering graphic communication. Introduction to HVAC, Manufacturing and Mechatronics concentrations. Includes first quarter cornerstone service learning project.",
      "format": "1 laboratory.",
      "other": "Formerly ME 134."
    },
    {
      "id": "CalPoly_ME 129",
      "course name": "Introduction to Mechanical Engineering II",
      "prerequisite": [
        "ME 128"
      ],
      "units": "1 unit",
      "term": [
        "Winter"
      ],
      "description": "Communication of designs for manufacturing using basic definitions of points, lines and planes in space. Pictorials, orthographic projection, section views and auxiliary views. Techniques from geometry and spatial definitions integrated to provide information to both the design and manufacturing processes.",
      "format": "1 laboratory."
    },
    {
      "id": "CalPoly_ME 130",
      "course name": "Introduction to Mechanical Engineering III",
      "prerequisite": [
        "ME 129"
      ],
      "units": "1 unit",
      "term": [
        "Spring"
      ],
      "description": "Use of computer - aided design to communicate parts and assemblies. Dimensioned drawings for part fabrication. Introduction to fits and tolerances. Layout drawings and functional assemblies.",
      "format": "1 laboratory."
    },
    {
      "id": "CalPoly_ME 163",
      "course name": "Freshmen Orientation to Mechanical Engineering",
      "units": "1 unit",
      "term": [
        "Fall"
      ],
      "description": "Introduction to career opportunities in Mechanical Engineering, exploration of the ethical responsibilities of being a student and professional engineer, and familiarization with the Mechanical Engineering curriculum including cooperative education and international exchange opportunities. Conclusion of cornerstone service learning project. Field trip may be required.",
      "format": "1 activity."
    },
    {
      "id": "CalPoly_ME 211",
      "course name": "Engineering Statics",
      "prerequisite": [
        "MATH 241 (or concurrently)",
        "PHYS 131 or PHYS 141"
      ],
      "units": "3 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Analysis of forces on engineering structures in equilibrium. Properties of forces, moments, couples, and resultants. Equilibrium conditions, friction, centroids, area moments of inertia. Introduction to mathematical modeling and problem solving. Vector mathematics where appropriate.",
      "format": "3 lectures.",
      "other": "Crosslisted as HNRS / ME211."
    },
    {
      "id": "CalPoly_ME 212",
      "course name": "Engineering Dynamics",
      "prerequisite": [
        "MATH 241",
        "ME 211 or ARCE 211"
      ],
      "units": "3 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Analysis of motions of particles and rigid bodies encountered in engineering. Velocity, acceleration, relative motion, work, energy, impulse, and momentum. Further development of mathematical modeling and problem solving. Vector mathematics where appropriate. 3 lectures. Crosslisted as HNRS214/ME212."
    },
    {
      "id": "CalPoly_ME 228",
      "course name": "Engineering Design Communication",
      "units": "2 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Use of engineering communication principles to communicate details of project designs including : sketching, orthographic projection, section and auxiliary views, dimensioning, and tolerances. Hand and computer based methods explored. Introduction to design for manufacturability.",
      "format": "2 laboratories."
    },
    {
      "id": "CalPoly_ME 229",
      "course name": "Introduction to Mechanical Engineering for Transfers",
      "units": "2 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Introduction to Mechanical Engineering and its application in professional practice. Includes design, analysis, testing and dissection of mechanical engineering systems. Investigation of personal and professional ethics. Familiarization with the ME curriculum including cooperative education and international exchange opportunities.",
      "format": "1 lecture, 1 laboratory."
    },
    {
      "id": "CalPoly_ME 234",
      "course name": "Philosophy of Design",
      "units": "3 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "General approach to the meaning of engineering design. Conceptual blocks, creativity, design process, design considerations and elements.",
      "format": "3 lectures."
    },
    {
      "id": "CalPoly_ME 236",
      "course name": "Measurement and Engineering Data Analysis",
      "units": "3 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Introduction to principles and practice of measurement. Application of probability distributions, sampling, confidence intervals, uncertainty, and regression analysis to engineering experiments and design. Techniques for measuring common physical quantities such as temperature, pressure, and strain. Introduction to laboratory report writing and communication of technical data.",
      "format": "2 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_ME 251",
      "course name": "Introduction to Detailed Design with Solid Modeling",
      "prerequisite": [
        "ME 130 or ME 228"
      ],
      "units": "2 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Part and system or assembly design with solid modeling using current software and hardware. Techniques of advanced communication including weld symbols, threaded fasteners, dimensioning and tolerancing. Creation of design layouts and part models with varied configurations and dynamic assembly models. Introduction to section mass and inertia properties. Emphasis of group work and peer review in the production of parts for assemblies.",
      "format": "1 lecture, 1 laboratory."
    },
    {
      "id": "CalPoly_ME 270",
      "course name": "Selected Topics",
      "units": "1-4 units",
      "term": [
        "tbd"
      ],
      "description": "Directed group study of selected topics. The Schedule of Classes will list title selected. Total credit",
      "grading": "limited to 8 units. 1 to",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_ME 271",
      "course name": "Selected Laboratory",
      "units": "1-2 units",
      "term": [
        "tbd"
      ],
      "description": "Directed group laboratory study of selected topics. The Schedule of Classes will list title selected. Total credit",
      "grading": "limited to 4 units.",
      "format": "1 to 2 laboratories."
    },
    {
      "id": "CalPoly_ME 302",
      "course name": "Thermodynamics I",
      "prerequisite": [
        "ME 212",
        "PHYS 132"
      ],
      "units": "3 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Properties of working fluids and fundamental relations for processes involving the transfer of energy. First and second laws of thermodynamics, irreversibility and availability.",
      "format": "3 lectures."
    },
    {
      "id": "CalPoly_ME 303",
      "course name": "Thermodynamics II",
      "prerequisite": [
        "ME 302"
      ],
      "units": "3 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Vapor and gas power cycles, refrigeration cycles, thermodynamic relations, psychrometrics, and chemical reactions.",
      "format": "3 lectures."
    },
    {
      "id": "CalPoly_ME 305",
      "course name": "Introduction to Mechatronics",
      "prerequisite": [
        "EE 321",
        "EE 361"
      ],
      "units": "4 units",
      "term": [
        "Fall",
        "Winter"
      ],
      "description": "Introduction to microcontrollers and assembly language programming. Emphasis on components and techniques for interfacing that are typical of embedded microcontroller applications ( A / D conversion, D / A conversion, interrupts, timers, and pulse - width modulation ). Laboratory exercises involve real - time interfacing of microcontrollers to external mechanical and/or electromechanical devices.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_ME 318",
      "course name": "Mechanical Vibrations",
      "prerequisite": [
        "ME 326",
        "MATH 344"
      ],
      "units": "4 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Free and forced vibration response of single and multiple degree of freedom systems. Experimental studies of the dynamic behavior of structures and machines. Instrumentation methods utilized in field and laboratory.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_ME 320",
      "course name": "Consumer Energy Guide",
      "units": "4 units",
      "term": [
        "ge area Fall"
      ],
      "description": "Interdisciplinary connection of everyday consumer decisions with energy costs, security, and global warming. Energy consumption by home appliances and automobiles. Methods to reduce the individual ' energy footprint ' with renewable energy, purchasing carbon offsets, and behavioral modifications.",
      "format": "4 lectures.",
      "other": "Fulfills GE Area F."
    },
    {
      "id": "CalPoly_ME 323",
      "course name": "Everything is Designed: The Invention and Evolution of Products",
      "units": "4 units",
      "term": [
        "ge area Fall"
      ],
      "description": "Investigation of engineering product designs, including social, environmental, and technological influences. Incorporation of engineering design tools to develop a product using creative methods and design methodology. Exploration of creative problem solving methods and barriers to creativity.",
      "format": "4 lectures.",
      "other": "Fulfills GE Area F."
    },
    {
      "id": "CalPoly_ME 326",
      "course name": "Intermediate Dynamics",
      "prerequisite": [
        "ME 212",
        "CSC 231 or CSC 234"
      ],
      "units": "4 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Continuation of ME212. Additional analysis of planar motion of rigid bodies with particular attention to rotating reference frames. Kinematics of linkages, three dimensional dynamics, introduction to numerical methods and dynamic simulation of mechanisms.",
      "format": "3 lectures, 1 activity."
    },
    {
      "id": "CalPoly_ME 328",
      "course name": "Design for Strength and Stiffness",
      "prerequisite": [
        "BMED 212 or ME 234",
        "CE 207",
        "CSC 231 or CSC 234",
        "MATE 210",
        "ME 212",
        "ME 251"
      ],
      "units": "4 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Design of machine parts by stress and deflection. Effects of fluctuating stresses and stress concentration. Design of shafts and other machine parts. Modern industrial design practice using standard components and design layout drawings.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_ME 329",
      "course name": "Mechanical Systems Design",
      "prerequisite": [
        "ME 328"
      ],
      "units": "4 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Design of mechanical equipment and systems using various machine elements and components such as threaded fasteners, power screws, springs, gears, bearings, clutches, prime movers, etc. Decision modeling based on technical and economic feasibility.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_ME 341",
      "course name": "Fluid Mechanics I",
      "prerequisite": [
        "MATH 242 or MATH 244",
        "ME 212"
      ],
      "units": "3 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Fluid properties and fluid statics. Euler and Bernoulli equations. Conservation equations ; dimensional analysis. Viscous pipe flow. Course may be offered in classroom - based or online format.",
      "format": "3 lectures."
    },
    {
      "id": "CalPoly_ME 347",
      "course name": "Fluid Mechanics II",
      "prerequisite": [
        "ME 236",
        "ME 341",
        "ME 302 or consent of instructor"
      ],
      "units": "4 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Conservation equations of fluid dynamics. Viscous flow, boundary layer concepts, lift and drag, compressible flow, turbomachinery. Laboratory measurement of turbomachine performance, velocity profiles, boundary layers on surfaces.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_ME 350",
      "course name": "Heat Transfer",
      "prerequisite": [
        "MATE 360",
        "MATE 380",
        "ME 302",
        "ME 341"
      ],
      "units": "4 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Basic principles of heat transfer by conduction and convection. Laboratory experiments to characterize thermodynamic material properties, energy conversion processes, thermodynamic cycles, and performance of heat transfer equipment. Not open to students with credit",
      "grading": "in ME 343.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_ME 359",
      "course name": "Fundamentals of HVAC Systems",
      "prerequisite": [
        "ME 302"
      ],
      "units": "4 units",
      "term": [
        "Winter"
      ],
      "description": "Fundamentals of heating, ventilating and air - conditioning ( HVAC ) systems, human comfort and indoor air quality, primary and secondary systems and components.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_ME 400",
      "course name": "Special Problems for Advanced Undergraduates",
      "units": "1-4 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Individual investigation, research, studies, or surveys of selected problems. Total credit",
      "grading": "limited to 4 units"
    },
    {
      "id": "CalPoly_ME 401",
      "course name": "Stress Analysis",
      "prerequisite": [
        "CE 207",
        "MATH 344",
        "ME 328 or consent of instructor"
      ],
      "units": "4 units",
      "term": [
        "Fall"
      ],
      "description": "Advanced strength of materials : behavior of disks, plates, and shells. Theory of elasticity. Energy methods.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_ME 402",
      "course name": "Orthopedic Biomechanics",
      "prerequisite": [
        "ME 328"
      ],
      "units": "4 units",
      "term": [
        "Spring"
      ],
      "description": "Biomechanical analysis of the musculoskeletal system. Emphasis on the use of statics, dynamics, strength of materials, viscoelasticity, and poroelasticity to analyze the mechanical loads acting on human joints, the mechanical properties of tissues, and the design of artificial joints.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_ME 404",
      "course name": "Applied Finite Element Analysis",
      "prerequisite": [
        "BMED 410",
        "CE 207"
      ],
      "units": "4 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Finite element based solutions to engineering problems with an emphasis on elastostatic problems in structural mechanics. The power and pitfalls associated with the finite element method highlighted through practical modeling assignments. Introduces the use of commercial finite element codes.",
      "format": "3 lectures, 1 laboratory.",
      "other": "Crosslisted as BMED / CE / ME404."
    },
    {
      "id": "CalPoly_ME 405",
      "course name": "Mechatronics",
      "prerequisite": [
        "ME 305",
        "ME 329 (may be taken concurrently)"
      ],
      "units": "4 units",
      "term": [
        "Winter",
        "Spring"
      ],
      "description": "Microprocessor applications in machine control and product design. Applied electronics. Drive technology ; transducers and electromechanical systems. Real - time programming. Mechatronic design methodology.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_ME 409",
      "course name": "Interdisciplinary Study in Biomechanics",
      "prerequisite": [
        "KINE 403"
      ],
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "Examination of human motion biomechanics. Experimental and analytical methods in motion analysis based on rigid body dynamics. Protocols for protection of human subjects in research. Hypothesis - driven research in interdisciplinary teams, including written proposal development and written / oral communication of results to a scientific audience.",
      "format": "1 lecture, 3 activities.",
      "other": "Crosslisted as BMED / KINE / ME409."
    },
    {
      "id": "CalPoly_ME 410",
      "course name": "Experimental Methods in Mechanical Design I",
      "prerequisite": [
        "ME 328"
      ],
      "units": "4 units",
      "term": [
        "Spring"
      ],
      "description": "Bonded resistance strain gages for static and dynamic measurements ; rosettes, bridge circuits, lead wire effects, special gages. Data acquisition systems, and measurement of displacement, velocity, and acceleration. Photoelastic methods including birefringent coatings. Applications in mechanical design and metrology.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_ME 412",
      "course name": "Composite Materials Analysis and Design",
      "prerequisite": [
        "AERO 331 or ME 328"
      ],
      "units": "4 units",
      "term": [
        "Fall",
        "Spring"
      ],
      "description": "Behavior of unidirectional fiber composites. Properties of short - fiber composites, and orthotropic lamina. Analysis of laminated composites. Strength and hygrothermal behavior of composite materials. Structural optimization.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_ME 415",
      "course name": "Energy Conversion",
      "prerequisite": [
        "ME 302"
      ],
      "units": "4 units",
      "term": [
        "Spring"
      ],
      "description": "Engineering aspects of energy sources, conversion and storage. Topics selected from fossil fuel systems, nuclear power, thermoelectric systems, thermionic converters, fuel cells, magnetohydrodynamic generators, and geothermal, tidal, wind and ocean temperature energy conversion systems.",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_ME 416",
      "course name": "Ground Vehicle Dynamics and Design",
      "prerequisite": [
        "ME 318",
        "ME 328"
      ],
      "units": "4 units",
      "term": [
        "Fall"
      ],
      "description": "Design of ground vehicles for directional stability and control. Tire mechanics and their effects on vehicle performance. Simulation of vehicle dynamics using digital computer. Synthesis of steering mechanism and suspension system.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_ME 420",
      "course name": "Thermal System Design",
      "prerequisite": [
        "ME 303",
        "ME 347",
        "ME 343 or ME 350"
      ],
      "units": "4 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Radiation and combined mode heat transfer. Design of thermal systems. Engineering economics, thermal component sizing, and steady - state simulation techniques applied to the design and performance analysis of thermal systems. Not open to students with credit in ME440.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_ME 422",
      "course name": "Mechanical Control Systems",
      "prerequisite": [
        "ME 318"
      ],
      "units": "4 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Modeling and control of physical systems. Design of mechanical, hydraulic and electrical systems using time response, frequency response, state space, and computer simulation.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_ME 423",
      "course name": "Robotics: Fundamentals and Applications",
      "prerequisite": [
        "ME 326",
        "ME 422"
      ],
      "units": "4 units",
      "term": [
        "Spring"
      ],
      "description": "Introduction to robots and their types. Homogeneous transformations. Kinematic equations and their solutions. Motion trajectories, statics, dynamics, and control of robots. Robot programming. Actuators, sensors and vision systems.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_ME 428",
      "course name": "Senior Design Project I",
      "prerequisite": [
        "ME 329"
      ],
      "units": "2 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "First of three courses taken sequentially in component and system design using real - world problems. Small teams study and apply techniques of the engineering design process including problem definition, concept generation, feasibility studies and decision making. Practice of professional skills including written and oral communication, teaming, project management, societal responsibility and ethics.",
      "format": "2 laboratories."
    },
    {
      "id": "CalPoly_ME 429",
      "course name": "Senior Design Project II",
      "prerequisite": [
        "ME 428"
      ],
      "units": "2 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Continuation of a project begun in ME428. Activities focused on detail design, analysis and material procurement.",
      "format": "2 laboratories."
    },
    {
      "id": "CalPoly_ME 430",
      "course name": "Senior Design Project III",
      "prerequisite": [
        "ME 429"
      ],
      "units": "2 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Completion of a project begun in ME428 and continued in ME429. Design verified through prototyping and testing.",
      "format": "2 laboratories."
    },
    {
      "id": "CalPoly_ME 431",
      "course name": "Mechanical Design Techniques",
      "prerequisite": [
        "ME 329"
      ],
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "Comprehensive study of various design methods and techniques. Techniques used to explore various structural concepts such as prestressing, shaping, sizing, etc. Simulation of systems using digital computer. Design criteria identification of design parameters and constraints.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_ME 434",
      "course name": "Enhanced Oil Recovery",
      "prerequisite": [
        "ME 302",
        "ME 347",
        "ME 350"
      ],
      "units": "4 units",
      "term": [
        "Winter"
      ],
      "description": "Primary, secondary, and tertiary ( enhanced ) oil recovery methods. Waterflooding, polymerflooding, gas injection, steam injection, in - situ combustion, chemical flooding, miscible flooding. Performance calculations and computer applications in EOR.",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_ME 435",
      "course name": "Drilling Engineering",
      "prerequisite": [
        "ME 329",
        "ME 347"
      ],
      "units": "4 units",
      "term": [
        "Fall"
      ],
      "description": "Theory and practice of oilwell planning, drilling, well logging, and completion applied to the development of new oil and gas production, from onshore and offshore fields.",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_ME 436",
      "course name": "Petroleum Production Engineering",
      "prerequisite": [
        "ME 329",
        "ME 347"
      ],
      "units": "4 units",
      "term": [
        "Spring"
      ],
      "description": "Design and operation of surface and subsurface equipment required in oil production. Processes and systems involved are rod pumping, gas lifting, acidizing, hydraulic fracturing, fluid gathering and storage, separation of oil, gas, water and sediment from produced fluid. Includes equipment used in enhanced oil recovery processes.",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_ME 437",
      "course name": "Nuclear Energy Power Generation",
      "prerequisite": [
        "ME 302",
        "PHYS 133"
      ],
      "units": "4 units",
      "term": [
        "Fall"
      ],
      "description": "Operation of a nuclear electric generation station ; includes reactor water chemistry, material science, electric science, mechanical science, civil engineering for the nuclear power plant engineers and digital process control systems. Field trip may be required.",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_ME 438",
      "course name": "Nuclear Power Plant Design",
      "prerequisite": [
        "ME 302",
        "ME 341"
      ],
      "units": "4 units",
      "term": [
        "Winter"
      ],
      "description": "Principal elements of pressurized water reactor nuclear power systems ; overview of reactor physics, thermodynamics, and heat transfer ; includes basic reactor physics, reactor heat generation, reactor plant systems, support systems, and reactor safety. Field trip may be required.",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_ME 439",
      "course name": "Nuclear Power Plant Operations",
      "prerequisite": [
        "ME 437 or ME 438"
      ],
      "units": "4 units",
      "term": [
        "Spring"
      ],
      "description": "Overview of mass, momentum and energy conversion related to nuclear power plants ; includes coupled neutronic / thermal models to study plant operation semi - quantitatively achieving an integrated plant understanding. Content includes : Neutron power kinetics, Coupled neutronic / thermal hydraulic modeling, Quantitative transient modeling, demonstration transients. Field trip may be required.",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_ME 440",
      "course name": "Thermal System Design and Optimization",
      "prerequisite": [
        "ME 303",
        "ME 347",
        "ME 343"
      ],
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "Design and optimization of thermal systems. Engineering economics, thermal component sizing, steady - state simulation, and optimization techniques applied to the design and performance analysis of thermal systems. Not open to students with credit in ME420.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_ME 441",
      "course name": "Single Track Vehicle Design",
      "prerequisite": [
        "ME 318",
        "ME 329"
      ],
      "units": "4 units",
      "term": [
        "Winter"
      ],
      "description": "Design of single track vehicles, including handling characteristics, ergonomics and human power, strength and stiffness considerations, braking and suspension. Laboratory focus on designing a single track vehicle, including fabrication of a handling prototype.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_ME 442",
      "course name": "Design of Machinery",
      "prerequisite": [
        "ME 212"
      ],
      "units": "4 units",
      "term": [
        "Fall"
      ],
      "description": "Graphical synthesis and analysis of mechanisms and machines. Analytical fundamentals for study of displacements, velocities, accelerations, and static and dynamic forces necessary for design of planar linkages and gearing systems. Creative design projects using software simulation tools.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_ME 443",
      "course name": "Turbomachinery",
      "prerequisite": [
        "MATH 344",
        "ME 303",
        "ME 347",
        "ME 350"
      ],
      "units": "4 units",
      "term": [
        "Spring"
      ],
      "description": "Performance characteristics of various types for liquids and for gases. Criteria for proper selection of type and main dimensions. Cavitation criteria. Gas turbine cycles and performance. Two - dimensional cascades. Axial flow turbines and compressors. Centrifugal compressors and radial - inflow turbines.",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_ME 444",
      "course name": "Combustion Engine Design",
      "prerequisite": [
        "ME 303",
        "ME 347",
        "ME 350"
      ],
      "units": "4 units",
      "term": [
        "Winter"
      ],
      "description": "Application of design parameters to the various engine cycles. Aspects of the combustion processes. Emission regulation effects on engine design. Static and dynamic loading.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_ME 450",
      "course name": "Solar Thermal Power Systems",
      "prerequisite": [
        "ME 343"
      ],
      "units": "4 units",
      "term": [
        "Winter"
      ],
      "description": "High and intermediate temperature systems for conversion of solar energy to mechanical power and heat. Thermal energy storage and total thermal energy system design.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_ME 456",
      "course name": "HVAC Air and Water Distribution System Design",
      "prerequisite": [
        "ME 302",
        "ME 347"
      ],
      "units": "4 units",
      "term": [
        "Fall"
      ],
      "description": "Air and water distribution components and systems and the design of these systems with applications to the heating, ventilating and air - conditioning ( HVAC ) industry.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_ME 457",
      "course name": "Refrigeration Principles and Design",
      "prerequisite": [
        "ME 341",
        "ME 350"
      ],
      "units": "4 units",
      "term": [
        "Spring"
      ],
      "description": "Basic engineering principles of refrigeration processes including : vapor compression cycles, multipressure systems, absorption systems, steam jet cooling, air cycles, and low temperature refrigeration.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_ME 458",
      "course name": "Building Heating and Cooling Loads",
      "prerequisite": [
        "ME 303",
        "ME 350"
      ],
      "units": "4 units",
      "term": [
        "Fall"
      ],
      "description": "Building heating and cooling load calculations, estimating energy consumption and operating costs for heating, ventilating and air - conditioning system design and selection.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_ME 459",
      "course name": "HVAC Senior Design Project I",
      "prerequisite": [
        "ME 456",
        "ME 458"
      ],
      "units": "3 units",
      "term": [
        "Winter"
      ],
      "description": "First quarter of a two quarter sequence. Team project work in designing heating, ventilating and air - conditioning ( HVAC ) systems. New developments, policies and practices in the HVAC industry. Professional ethics relevant for practicing engineers.",
      "format": "1 lecture, 2 laboratories."
    },
    {
      "id": "CalPoly_ME 460",
      "course name": "HVAC Senior Design Project II",
      "prerequisite": [
        "ME 459"
      ],
      "units": "2 units",
      "term": [
        "Spring"
      ],
      "description": "Continuation of work begun in ME459. Team project designing heating, ventilating and air - conditioning ( HVAC ) systems.",
      "format": "2 laboratories."
    },
    {
      "id": "CalPoly_ME 470",
      "course name": "Selected Advanced Topics",
      "units": "1-4 units",
      "term": [
        "tbd"
      ],
      "description": "Directed group study of selected topics for advanced students. Open to undergraduate and graduate students. The Schedule of Classes will list title selected. Total credit",
      "grading": "limited to 12 units. 1 to",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_ME 471",
      "course name": "Selected Advanced Laboratory",
      "units": "1-4 units",
      "term": [
        "tbd"
      ],
      "description": "Directed group laboratory study of selected topics for advanced students. Open to undergraduate and graduate students. The Schedule of Classes will list title selected. Total credit",
      "grading": "limited to 8 units.",
      "format": "1 to 4 laboratories."
    },
    {
      "id": "CalPoly_ME 488",
      "course name": "Wind Energy Engineering",
      "prerequisite": [
        "ME 329",
        "ME 347",
        "ME 302"
      ],
      "units": "4 units",
      "term": [
        "Spring"
      ],
      "description": "Engineering aspects of windpower systems including mechanical design, support structure design, aerodynamic analysis, wind field analysis, system concepts and analysis, and economics.",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_ME 493",
      "course name": "Cooperative Education Experience",
      "units": "2 units",
      "term": [
        "cr/nc"
      ],
      "description": "Part - time work experience in business, industry, government, and other areas of student career interest. Positions are paid and usually require relocation and registration in course for two consecutive quarters. Formal report and evaluation by work supervisor required. Credit / No Credit grading only. No major credit allowed ; total credit",
      "grading": "limited to 6 units"
    },
    {
      "id": "CalPoly_ME 494",
      "course name": "Cooperative Education Experience",
      "units": "6 units",
      "term": [
        "cr/nc"
      ],
      "description": "Full - time work experience in business, industry, government, and other areas of student career interest. Positions are paid and usually require relocation and registration in course for two consecutive quarters. Formal report and evaluation by work supervisor required. Credit / No Credit grading only. No major credit allowed ; total credit",
      "grading": "limited to 18 units."
    },
    {
      "id": "CalPoly_ME 495",
      "course name": "Cooperative Education Experience",
      "units": "12 units",
      "term": [
        "cr/nc"
      ],
      "description": "Full - time work experience in business, industry, government, and other areas of student career interest. Positions are paid and usually require relocation and registration in course for two consecutive quarters. A more fully developed formal report and evaluation by work supervisor required. Credit / No Credit grading only. No major credit allowed ; total credit",
      "grading": "limited to 24 units."
    },
    {
      "id": "CalPoly_ME 500",
      "course name": "Individual Study",
      "units": "1-3 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Advanced study planned and completed under the direction of a member of the department faculty. Open only to graduate students who have demonstrated ability to do independent work. Enrollment by petition."
    },
    {
      "id": "CalPoly_ME 501",
      "course name": "Continuum Mechanics and Elasticity",
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "Introduction to continuum mechanics. Kinematics, stress, and balance laws. Constitutive theory for isotropic and anisotropic solids and viscous fluids. Applications including design of beams and pressure vessels, stress concentrations, fiber - reinforced composites, and non - homogeneous biological materials. 4 lectures. Crosslisted as CE511/ME501."
    },
    {
      "id": "CalPoly_ME 503",
      "course name": "Inelastic Stress Analysis",
      "prerequisite": [
        "ME 501 or CE 511"
      ],
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "Perfectly plastic and work hardening materials ; von Mises and Tresca yield, isotropic and kinematic hardening flow rules, boundary - value problems. Finite elasticity : kinematics, Cauchy- and Green - elasticity, invariance, constraints, Neo - Hookean and Mooney - Rivlin materials, experimental approaches, non - uniqueness, anisotropy, residual stress, thermoelasticity, boundary - value problems. 4 lectures. Crosslisted as CE513/ME503."
    },
    {
      "id": "CalPoly_ME 504",
      "course name": "Finite Element Analysis",
      "prerequisite": [
        "CE 511 or ME 501 or consent of instructor"
      ],
      "units": "4 units",
      "term": [
        "Spring"
      ],
      "description": "Linear finite element theory and analysis. Strong, weak and variational formulations. Physical and isoparametric spaces. Error estimates and numerical integration. Development of finite element algorithms. Use of commercial finite element codes to illustrate course concepts including modeling issues and limitations.",
      "format": "3 lectures, 1 laboratory.",
      "other": "Crosslisted as CE / ME504."
    },
    {
      "id": "CalPoly_ME 506",
      "course name": "System Dynamics",
      "units": "4 units",
      "term": [
        "Spring"
      ],
      "description": "Unified approach for mathematical modeling and analysis of dynamic physical systems which may store energy in multiple energy domains. Emphasis on developing lumped - parameter linear system models from a set of primitive elements in a systematic manner.",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_ME 507",
      "course name": "Mechanical Control System Design",
      "units": "4 units",
      "term": [
        "Fall"
      ],
      "description": "Application of principles of high - level design to mechanical control system implementation. Use of modified state transition logic in conjunction with object - oriented programming as design methodology. Real - time programming using above techniques for control of mechanical systems.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_ME 517",
      "course name": "Advanced Vibrations",
      "prerequisite": [
        "ME 318"
      ],
      "units": "4 units",
      "term": [
        "Spring"
      ],
      "description": "Vibration of complex engineering systems. Inertia and stiffness matrices. Natural frequencies and normal modes. Approximate solutions and computer techniques. Response to transient and periodic inputs.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_ME 518",
      "course name": "Machinery Vibration and Rotor Dynamics",
      "prerequisite": [
        "ME 318"
      ],
      "units": "4 units",
      "term": [
        "Winter"
      ],
      "description": "Vibrations relating to rotating machinery. Modeling of structural rotordynamic phenomena induced by shaft flexibility, bearings, and seals. Laboratory measurement of rotor system dynamic response and interpretation of machinery diagnostic information. Research project on a related topic.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_ME 540",
      "course name": "Viscous Flow",
      "prerequisite": [
        "ME 347",
        "MATH 344"
      ],
      "units": "4 units",
      "term": [
        "Winter"
      ],
      "description": "Introduction to tensor calculus and indicial notation. Development of Reynolds ' Transport Theory. Special forms of the governing equations of fluid motion. Internal flows and other classical solutions to the Navier - Stokes equations.",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_ME 541",
      "course name": "Advanced Thermodynamics",
      "prerequisite": [
        "ME 303",
        "ME 347",
        "ME 350"
      ],
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "Selected modern applications of thermodynamics which may include topics from : 1 ) equilibrium and kinetics as applied to combustion and air pollution, analysis and evaluation of techniques used to predict properties of gases and liquids, and 2 ) improvement of modern thermodynamic cycles by second law analysis.",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_ME 542",
      "course name": "Dynamics and Thermodynamics of Compressible Flow",
      "prerequisite": [
        "MATH 244",
        "ME 303",
        "ME 347",
        "ME 350"
      ],
      "units": "4 units",
      "term": [
        "Fall"
      ],
      "description": "Control volume analysis of fluid - thermo equations for one - dimensional, compressible flow involving area change, normal shocks, friction, and heat transfer. Two - dimensional supersonic flow including linearization, method of characteristics, and oblique shocks. One - dimensional constant area, unsteady flow,",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_ME 552",
      "course name": "Advanced Heat Transfer I",
      "prerequisite": [
        "MATH 344",
        "ME 347",
        "ME 350"
      ],
      "units": "4 units",
      "term": [
        "Fall"
      ],
      "description": "Advanced principles of heat transfer. Classical solution techniques to problems in conduction and/or radiation.",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_ME 553",
      "course name": "Advanced Heat Transfer II",
      "prerequisite": [
        "MATH 344",
        "ME 347",
        "ME 350"
      ],
      "units": "4 units",
      "term": [
        "Winter"
      ],
      "description": "Advanced principles of heat transfer. Classical solution techniques to problems in convection.",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_ME 554",
      "course name": "Computational Heat Transfer",
      "prerequisite": [
        "MATH 418",
        "ME 347",
        "ME 350"
      ],
      "units": "4 units",
      "term": [
        "Spring"
      ],
      "description": "Numerical solutions of classical, industrial, and experimental problems in conduction, convection, and radiation heat transfer.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_ME 556",
      "course name": "Advanced Heat Transfer III",
      "prerequisite": [
        "ME 347 or FPE 502",
        "ME 350"
      ],
      "units": "4 units",
      "term": [
        "Spring"
      ],
      "description": "Advanced principles of heat transfer. Classical solution techniques to problems in radiation with applications related to the role of radiation heat transfer in the development of fire in buildings. 4 lectures. Crosslisted as FPE / ME556."
    },
    {
      "id": "CalPoly_ME 563",
      "course name": "Graduate Seminar",
      "units": "1 unit",
      "term": [
        "Winter"
      ],
      "description": "Current developments in mechanical engineering. Participation by graduate students, faculty and guests. 1 seminar."
    },
    {
      "id": "CalPoly_ME 570",
      "course name": "Selected Advanced Topics",
      "units": "1-4 units",
      "term": [
        "tbd"
      ],
      "description": "Directed group study of selected topics for advanced students. The Schedule of Classes will list topic selected. Total credit limited to 8 units ; may be repeated in same term.",
      "format": "1 - 4 seminars."
    },
    {
      "id": "CalPoly_ME 571",
      "course name": "Selected Advanced Laboratory",
      "units": "1-4 units",
      "term": [
        "tbd"
      ],
      "description": "Directed group laboratory study of selected topics for advanced students. The Schedule of Classes will list topic selected. Total credit limited to 8 units ; may be repeated in same term.",
      "format": "1 - 4 laboratories."
    },
    {
      "id": "CalPoly_ME 579",
      "course name": "Fluid Power Control",
      "prerequisite": [
        "ME 422"
      ],
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "Design, analysis, and control of fluid power systems. Analysis of fluid power system components such as valves, actuators, pumps and motors. System response and stability. Dynamic modeling and computer simulation",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_ME 599",
      "course name": "Design Project (Thesis)",
      "units": "1-9 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Each individual or group will be assigned a project for solution under faculty supervision as a requirement for the master 's degree, culminating in a written report / thesis."
    }
  ]
}