{
  "subjectOf": {
    "subject": "Health and Wellness Courses",
    "id": "HWE"
  },
  "providerOf": {
    "id": "AshFord",
    "university": "Ashford University",
    "hasSubject": "Health and Wellness Courses"
  },
  "courses": [
    {
      "id": "AshFord_HWE 200",
      "course name": "Introduction to Health & Wellness",
      "units": "3 Credits",
      "description": "This course provides students with a holistic overview of the multi-faceted dimensions of health and wellness across the lifespan. The seven dimensions of health: Physical, social, intellectual, emotional, occupational, spiritual, and environmental are explored within the context of a wellness lifestyle."
    },
    {
      "id": "AshFord_HWE 230",
      "course name": "Functional Anatomy",
      "units": "3 Credits",
      "description": "In this course, students study the structure and function of muscular and skeletal systems within the human body using a regional approach. Students are given the opportunity to learn about anatomical variation, the functional importance of this variation, and analysis of movement. This course expands upon the anatomical concepts provided in the prerequisite, The Human Body, Health and Disease."
    },
    {
      "id": "AshFord_HWE 330",
      "course name": "Musculoskeletal Anatomy & Physiology",
      "units": "3 Credits",
      "description": "In this course, students study the structure and function of muscular and skeletal systems within the human body using a regional approach. Students are given the opportunity to learn about anatomical variation, the functional importance of this variation, and common pathologies of the upper and lower extremities and trunk. This course expands upon the anatomical concepts provided in the prerequisite, The Human Body, Health, and Disease. ",
      "prerequisite": [
        "HPR 205 "
      ]
    },
    {
      "id": "AshFord_HWE 340",
      "course name": "Exercise & Physiology",
      "units": "3 Credits",
      "description": "This course introduces students to physiological responses to exercise in the human body. Students compare the major physiological systems (energy transfer, cardiovascular, respiratory, neuromuscular, etc.) at rest, explain the systemic adaptations that occur with acute and long-term exercise, and evaluate how these activities affect health and human performance. Students also analyze how nutrition and pharmacological aids impact athletic performance. ",
      "prerequisite": [
        "HPR 205",
        "HWE 330"
      ]
    },
    {
      "id": "AshFord_HWE 415",
      "course name": "Stress Management",
      "units": "3 Credits",
      "description": "This course will provide students with the opportunity to learn about the effects of stress, apply stress management techniques, and develop stress management programs while considering various cultural backgrounds. Students will analyze the relationship between stress and health. This course is designed to provide the student with a basic understanding of stress management concepts including causes and effects of acute and chronic stress as well as techniques used to manage stress. ",
      "prerequisite": [
        "HWE 200"
      ]
    },
    {
      "id": "AshFord_HWE 420",
      "course name": "Wellness for Special Populations",
      "units": "3 Credits",
      "description": "This course is designed to provide students the opportunity to enhance their understanding of nutritional concepts and designing exercise programs for special populations. Students will learn how to apply knowledge to develop and modify exercise plans for individuals with special conditions. Special populations that will be covered in this course will include but not limited to: the elderly, pregnant women, individuals at risk for disease (i.e. elderly, obese), and individuals living with health conditions (i.e. cardiovascular disease, arthritis, pulmonary disease, obesity, diabetes, hypertension, etc.). Risks, contraindications, and benefits of exercise for these special populations also will be covered. ",
      "prerequisite": [
        "HWE 200",
        "HWE 330",
        "HWE 340",
        "HCS 334"
      ]
    },
    {
      "id": "AshFord_HWE 498",
      "course name": "Health & Wellness Capstone",
      "units": "3 Credits",
      "description": "This course is a synthesis of the major ideas, perspectives, and concepts gained from the study of health and wellness. Assignments provide students with an opportunity to create health and wellness programs for target populations and apply appropriate health promotion strategies and techniques to benefit these groups. Students analyze lifestyle factors that negatively or positively affect health and evaluate the effectiveness of wellness programs. This course also provides an opportunity for the students to develop career- related tools for use in professional situations ",
      "prerequisite": [
        "GEN 499"
      ]
    }
  ]
}