{
  "subjectOf": {
    "subject": "English Courses",
    "id": "ENG"
  },
  "providerOf": {
    "id": "AshFord",
    "university": "Ashford University",
    "hasSubject": "English Courses"
  },
  "courses": [
    {
      "id": "AshFord_ENG 121",
      "course name": "English Composition I",
      "units": "3 Credits",
      "description": "This course is designed to enable students to develop competence in analyzing, organizing, and developing ideas. Additionally, students will locate and use library resources to support ideas, and to adapt their writing to various audiences. The course focuses on instruction and practice in writing and critical reading."
    },
    {
      "id": "AshFord_ENG 122",
      "course name": "English Composition II",
      "units": "3 Credits",
      "description": "This course provides instruction and practice in writing a well-structured, logical, and effective academic essay. Students will engage with the instructor, classmates, course materials, and additional resources to develop research, writing, revision, and editing processes. "
    },
    {
      "id": "AshFord_ENG 125",
      "course name": "Introduction to Literature",
      "units": "3 Credits",
      "description": "This course is an introduction to the basic elements of fiction, poetry, and drama. Emphasis is on reading literature to perceive the techniques used in each genre, to understand the basic theoretical approaches to literature, to acquire the vocabulary associated with literary criticism, and to analyze and evaluate literature."
    },
    {
      "id": "AshFord_ENG 201",
      "course name": "American Literature to",
      "units": "3 Credits",
      "description": "This course will examine American literature from early colonization through 1865, including texts from the colonial, revolutionary, and antebellum periods. The focus will be upon literary analysis and literary movements contextualized by American history and culture.",
      "similarTo": [
        "CalPoly_ENGL 360",
        "CalPoly_ENGL 511"
      ]
    },
    {
      "id": "AshFord_ENG 202",
      "course name": "American Literature After",
      "units": "3 Credits",
      "description": "This course will examine American literature focusing on a selection of works published between 1865 and the present. We will explore the impact of social and cultural transformations on our national literature working through literary movements and paying close attention to the development of ideas about gender, race, region and nation as expressed in fiction, poetry, and drama.",
      "similarTo": [
        "CalPoly_ENGL 347"
      ]
    },
    {
      "id": "AshFord_ENG 225",
      "course name": "Introduction to Film",
      "units": "3 Credits",
      "description": "This course is designed to help students understand and appreciate movies and film more completely. The course examines the ways in which movies and films are shot, tell stories, develop characters, and depict physical reality. Classes consist of critique and analysis of movies and films."
    },
    {
      "id": "AshFord_ENG 301",
      "course name": "American Literature to",
      "units": "3 Credits",
      "description": "This course will examine American literature from early colonization through 1865, including texts from the colonial, revolutionary, and antebellum periods. The focus will be upon literary analysis and literary movements contextualized by American history and culture.",
      "similarTo": [
        "CalPoly_ENGL 360",
        "CalPoly_ENGL 511"
      ]
    },
    {
      "id": "AshFord_ENG 315",
      "course name": "Business & Professional Writing",
      "units": "3 Credits",
      "description": "Instruction in the planning, organization, construction, style, and tone of several forms of business and professional correspondence: letters, interoffice communication, resumes, and formal reports. A review of grammar, punctuation, and usage is incorporated into the course. ",
      "prerequisite": [
        "ENG 122"
      ]
    },
    {
      "id": "AshFord_ENG 318",
      "course name": "Creative Writing",
      "units": "3 Credits",
      "description": "This course provides writing experiences in fiction, nonfictionand poetry for students who have a strong interest in creative expression and have some experience in writing in one of these genres. Various aspects of the imaginative process are explored with separate application made to the genres of fiction, nonfiction, and poetry. Studentswrite in eachgenre, participate in workshops with instructors, join with instructors and writing practitioners in critiquing colleagues work, and make presentations of their own work."
    },
    {
      "id": "AshFord_ENG 325",
      "course name": "Intermediate Composition",
      "units": "3 Credits",
      "description": "Intermediate Composition is designed for students who have some experience with college-level writing but want to develop their ability to write. The goal of this course is to help students learn techniques for writing effective narrative, reflective, analytical, and research essays. These techniques include the effective use of specific details to engage and persuade readers, methods of organization that enable readers to follow a line of thinking, and strategies for editing sentences for clarity and conciseness. ",
      "prerequisite": [
        "ENG 121",
        "ENG 122 "
      ]
    },
    {
      "id": "AshFord_ENG 328",
      "course name": "Scientific & Technical Writing",
      "units": "3 Credits",
      "description": "Students will develop the skills necessary for writing about scientific, environmental, medical, and technological topics. Emphasis is placed on making complex and technical information understandable to a variety of audiences. ",
      "prerequisite": [
        "ENG 122"
      ]
    },
    {
      "id": "AshFord_ENG 341",
      "course name": "Studies in Literary Genres",
      "units": "3 Credits",
      "description": "This course will introduce students to literary genres such as poetry, short fiction, creative non-fiction, drama, and the novel. Students will read, analyze, and write critically about representative selections in the various genres."
    },
    {
      "id": "AshFord_ENG 345",
      "course name": "British Literature I",
      "units": "3 Credits",
      "description": "This course examines writing by representative British authors in various genres from the Anglo-Saxon period through the mid-eighteenth century."
    },
    {
      "id": "AshFord_ENG 346",
      "course name": "British Literature II",
      "units": "3 Credits",
      "description": "This course provides a survey of writing by representative British authors in various genres from the Romantic Period to the present."
    },
    {
      "id": "AshFord_ENG 353",
      "course name": "Evolution & History of the English Language",
      "units": "3 Credits",
      "description": "Where did English come from, how has it evolved into the language that is used today, and why does American English behave differently than, for example, the English spoken in Ireland? Also, in what ways are different languages distinct, and how are they similar? Students will trace the historical origins and influences of the transformation of the English language. Students will also explore the major theories of the evolution of language."
    },
    {
      "id": "AshFord_ENG 380",
      "course name": "Literary Research ",
      "units": "3 Credits",
      "description": "This course is designed to teach the techniques for conducting literary research. Students will focus on particular authors while focusing on the essential skills of literary research. In addition to short critical essays, students will produce a major research paper."
    },
    {
      "id": "AshFord_ENG 438",
      "course name": "Literary Theory",
      "units": "3 Credits",
      "description": "This course is designed to provide students with the knowledge, skills, and tools to develop an understanding of the nature of literature, what functions it has, and what the relation of the text is to the author, the reader, language, society, and history.",
      "similarTo": [
        "CalPoly_ENGL 380"
      ]
    },
    {
      "id": "AshFord_ENG 497",
      "course name": "English Capstone",
      "units": "3 Credits",
      "description": "Students will demonstrate mastery of the concepts and methodology in the major by producing a final project that includes extensive research into the selected topic. "
    }
  ]
}