{
  "subjectOf": {
    "id": "FSN",
    "subject": "Food Science and Nutrition"
  },
  "providerOf": {
    "id": "CalPoly",
    "university": "California Polytechnic State University",
    "hasSubject": "Food Science and Nutrition"
  },
  "courses": [
    {
      "id": "CalPoly_FSN 101",
      "course name": "Orientation to the Food Science and Nutrition Majors",
      "units": "1 unit",
      "term": [
        "cr/nc"
      ],
      "description": "Understanding the depth and breadth of the Food Science and Nutrition programs. Emphasis on academic and career planning. Students are required to complete this course within their first year in the major. Separate sections will be offered for each major. Credit / No Credit grading only.",
      "format": "1 lecture."
    },
    {
      "id": "CalPoly_FSN 121",
      "course name": "Fundamentals of Food",
      "units": "4 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Theoretical aspects and practical applications of the principles of culinary science and food preparation.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_FSN 125",
      "course name": "Introduction to Food Science",
      "units": "4 units",
      "term": [
        "Fall"
      ],
      "description": "Basic principles of food science. Chemical, physical, and microbiological properties of foods. Ingredient properties, preservation, and processing. Overview of the commercial food processing industry at state and national levels. Field trip may be required.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_FSN 200",
      "course name": "Special Problems for Undergraduates",
      "units": "1-4 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Individual investigation, research studies, or surveys of selected problems. Total credit limited to 6 units, with a maximum of 4 units per quarter."
    },
    {
      "id": "CalPoly_FSN 201",
      "course name": "Enterprise Project",
      "prerequisite": [
        "FSN 125 or FSN 230 or FSN 121"
      ],
      "units": "1-4 units",
      "term": [
        "cr/nc"
      ],
      "description": "Post - harvest processing of a high quality food product. Project participation is voluntary and subject to approval by the department head and the Cal Poly Corporation. Total degree credit for FSN201 and FSN401 combined limited to 12 units. Credit / No Credit grading only."
    },
    {
      "id": "CalPoly_FSN 204",
      "course name": "Food Processing Operations",
      "prerequisite": [
        "FSN 125 or FSN 230"
      ],
      "units": "4 units",
      "term": [
        "Winter"
      ],
      "description": "Applied food manufacturing and processing technology emphasizing unit operations. Water removal in foods ( dehydration, spray drying, vacuum concentration ), heat removal ( refrigeration, freezing ), and osmotic preservation. Students produce processed foods in a pilot plant. Field trip may be required.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_FSN 210",
      "course name": "Nutrition",
      "units": "4 units",
      "term": [
        "ge area b5"
      ],
      "description": "Introduction to the science of human nutrition. Nutrient structure, metabolism, function and requirements. Application of nutrition science principles to promote optimal health. Course may be offered in classroom - based or online format.",
      "format": "4 lectures.",
      "other": "Fulfills GE B5."
    },
    {
      "id": "CalPoly_FSN 230",
      "course name": "Elements of Food Processing",
      "units": "4 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Principles of food processing operations covering thermal processing, freezing, dehydration, fermentation and raw material handling. Overview of food technology, food quality, spoilage, packaging and label requirements. For non - Food Science majors only. Field trip may be required.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_FSN 244",
      "course name": "Cereal and Bakery Science",
      "prerequisite": [
        "FSN 125 or FSN 230"
      ],
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "Applied science of cereal - based products. Theory and practice underlying preparation of doughs, batters, fillings, and glazes. Chemistry of baking doughs and batters and storage of finished products. Marketing and product development of breads, cakes, cookies, and pastries. Comparative nutritional evaluation of flours, grains, and finished products.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_FSN 250",
      "course name": "Food and Nutrition: Customs and Culture",
      "units": "4 units",
      "term": [
        "ge area d4; uscp"
      ],
      "description": "Anthropological perspective of traditional and contemporary food customs and culture. Major emphasis on U.S. cultures including Native American, Hispanic American, African American, and Asian American. Opportunities to explore personal cultural food experiences. Course may be offered in classroom - based or online format.",
      "format": "4 lectures.",
      "other": "Fulfills GE D4 and USCP."
    },
    {
      "id": "CalPoly_FSN 275",
      "course name": "Elements of Food Safety",
      "units": "4 units",
      "term": [
        "Spring"
      ],
      "description": "Introduction to food safety from farm - to - fork. Topics include good agricultural practices, good manufacturing practices, food safety regulations, and an overview of Hazard Analysis Critical Control Point ( HACCP ). Emphasis on control of biological, chemical, and physical hazards to assure food safety. Not open to Food Science majors.",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_FSN 290",
      "course name": "Selected Topics",
      "units": "1-4 units",
      "term": [
        "tbd"
      ],
      "description": "Directed group study of selected topics. The Schedule of Classes will list title selected. Total credit",
      "grading": "limited to 8 units. 1 to",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_FSN 304",
      "course name": "Advanced Culinary Principles and Practice",
      "prerequisite": [
        "CHEM 127",
        "FSN 121"
      ],
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "Chemistry of starch, fat and proteins and its impact on texture, taste, flavor and appearance of food. Effects of microorganisms on changes of food during preparation and storage.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_FSN 310",
      "course name": "Maternal and Child Nutrition",
      "prerequisite": [
        "FSN 210"
      ],
      "units": "4 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Nutritional needs and related nutritional challenges of women and children, including fertility, pregnancy and lactation ; physical, nutritional, social growth and development from infancy through adolescence. Current nutrition issues in maternal and child nutrition.",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_FSN 311",
      "course name": "Sensory Evaluation of Food",
      "prerequisite": [
        "STAT 218",
        "FSN 125 or FSN 230"
      ],
      "units": "4 units",
      "term": [
        "Winter"
      ],
      "description": "Sensory attributes of food, physiological basis of sensory evaluation, sensory panels, environment for sensory evaluation, sample preparation and presentation, types of score cards, statistical methods for data analysis and interpretation.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_FSN 315",
      "course name": "Nutrition in Aging",
      "prerequisite": [
        "FSN 210"
      ],
      "units": "4 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Nutrition issues in the middle and later years. Changes in organ systems, nutrient needs, functional status, and food preferences as adults age. Nutrition and chronic disease. Nutritional assessment and screening. Nutrition - related health care and social services.",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_FSN 319",
      "course name": "Food Technology for the Consumer",
      "units": "4 units",
      "term": [
        "ge area Fall"
      ],
      "description": "Overview of the science and technology used to produce the foods consumed on a daily basis. Food science, biotechnology, food law, processing, preservation, ingredient functionality, package label information, and food safety information. Not open to Food Science Majors.",
      "format": "4 lectures.",
      "other": "Fulfills GE Area F."
    },
    {
      "id": "CalPoly_FSN 321",
      "course name": "Contemporary Issues in Food Choice and Preparation",
      "prerequisite": [
        "FSN 121",
        "FSN 210"
      ],
      "units": "4 units",
      "term": [
        "Winter",
        "Spring"
      ],
      "description": "Principles involved in the choice, purchase, and preparation of foods in a variety of settings and for various populations. Contemporary and ongoing issues associated with food and cooking in the context of nutrition and health. Planning and preparation of meals with emphasis on nutritional, aesthetic, economic and cultural aspects of food.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_FSN 328",
      "course name": "Nutrient Metabolism I",
      "prerequisite": [
        "BIO 161",
        "CHEM 313 or CHEM 371",
        "FSN 210"
      ],
      "units": "4 units",
      "term": [
        "Fall",
        "Winter"
      ],
      "description": "Metabolism of carbohydrates, fats and proteins as it applies to human nutrition. Integration and regulation of metabolic pathways.",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_FSN 329",
      "course name": "Nutrient Metabolism II",
      "prerequisite": [
        "FSN 328"
      ],
      "units": "4 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Continuation of FSN328. Biochemical, molecular, and physiological functions of vitamins and minerals and their interaction with other nutrients.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_FSN 330",
      "course name": "Introduction to Principles of Food Engineering",
      "prerequisite": [
        "FSN 125",
        "MATH 118 or equivalent",
        "PHYS 121"
      ],
      "units": "4 units",
      "term": [
        "Fall"
      ],
      "description": "Introduction to principles of food engineering and basic calculations needed for food plant operations. Unit conversions, material balance, heat balance, steam heating, psychrometry, vacuum and pressure. Field trip may be required.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_FSN 334",
      "course name": "Food Packaging",
      "prerequisite": [
        "FSN 125",
        "FSN 204"
      ],
      "units": "3 units",
      "term": [
        "Spring"
      ],
      "description": "Function of food packaging in food processing and preservation. Packaging materials and forms. Regulations and testing of food packaging material. Oral presentation required.",
      "format": "3 lectures."
    },
    {
      "id": "CalPoly_FSN 335",
      "course name": "Food Quality Assurance",
      "prerequisite": [
        "FSN 125 or FSN 230"
      ],
      "units": "4 units",
      "term": [
        "Fall"
      ],
      "description": "Microbiological and physical methods of analyses of foods used in food quality assurance and product development laboratories. Organization and management of quality assurance programs utilizing basic statistical control. Development of food production standards and interpretation of specifications. Packaging and container evaluation.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_FSN 341",
      "course name": "Fermented Foods",
      "units": "4 units",
      "term": [
        "Spring"
      ],
      "description": "Processing, manufacturing, historical and bio - technical applications of fermentation technology for the production of food and beverages. Wines of the world, distilled beverages, beers, fermented dairy, vegetable and meat products important to the post - harvest economy of California.",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_FSN 342",
      "course name": "Brewing Science",
      "prerequisite": [
        "CHEM 313",
        "MCRO 221"
      ],
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "Scientific principles of malting and brewing. Chemistry, microbiology, and technology of the entire brewing process, from the raw ingredients ( barley, malt, hops, water, yeast ) to the production of beer and its quality assurance.",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_FSN 343",
      "course name": "Institutional Foodservice I",
      "prerequisite": [
        "FSN 121"
      ],
      "units": "3 units",
      "term": [
        "Fall",
        "Winter"
      ],
      "description": "Principles of equipment selection and food service facility, planning with emphasis on sanitation and safety.",
      "format": "2 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_FSN 344",
      "course name": "Institutional Foodservice II",
      "prerequisite": [
        "FSN 321",
        "FSN 343"
      ],
      "units": "4 units",
      "term": [
        "Winter",
        "Spring"
      ],
      "description": "Continuation of FSN343. Economic principles and problems involved in planning and preparing food using institutional equipment to meet specific product standards for large groups. Field trip may be required.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_FSN 346",
      "course name": "Brewing Methods",
      "prerequisite": [
        "FSN 342"
      ],
      "units": "3 units",
      "term": [
        "tbd"
      ],
      "description": "Introduction to brewing practices and hands - on instruction on industry standard laboratory methods for the analysis of barley, malt, hops, water, yeast, and beer. Perform pilot brews and apply methodologies for the analysis of raw ingredients, process control, and final product. Field trip required. 1 lecture, 2 laboratories. Students must be 18 years of age or older."
    },
    {
      "id": "CalPoly_FSN 354",
      "course name": "Packaging Function in Food Processing",
      "units": "3 units",
      "term": [
        "Spring"
      ],
      "description": "Basic food spoilage and preservation mechanisms. The role of food packaging in food processing. Package and food compatibility. For non - Food Science majors.",
      "format": "3 lectures."
    },
    {
      "id": "CalPoly_FSN 364",
      "course name": "Food Chemistry",
      "prerequisite": [
        "FSN 125 or FSN 230",
        "CHEM 313"
      ],
      "units": "4 units",
      "term": [
        "Fall"
      ],
      "description": "Study of molecular properties of major food components such as water, carbohydrates, lipids, proteins, vitamins, minerals, pigments, enzymes and other important molecules as well as chemical reactions of these compounds occurring as a result of processing and or storage. Laboratory focus on assessment of the role of food components in food systems and food products.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_FSN 368",
      "course name": "Food Analysis",
      "prerequisite": [
        "FSN 364"
      ],
      "units": "4 units",
      "term": [
        "Winter"
      ],
      "description": "Principles of chemical and biochemical methods and techniques for measuring food protein, carbohydrates, lipids, water, vitamins, minerals and other components of foods using approved methods.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_FSN 370",
      "course name": "Food Plant Sanitation and Prerequisite Programs",
      "prerequisite": [
        "FSN 204",
        "MCRO 221"
      ],
      "units": "4 units",
      "term": [
        "Winter"
      ],
      "description": "Principles and practice of food plant sanitation and prerequisite programs to ensure production of a safe and wholesome food supply. Topics include good manufacturing practices, sanitary design, cleaning and sanitizing compound selection, pest management, waste treatment, and allergen control programs. Field trips required.",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_FSN 374",
      "course name": "Food Laws and Regulations",
      "prerequisite": [
        "FSN 125 or FSN 230 or WVIT 102"
      ],
      "units": "4 units",
      "term": [
        "Winter"
      ],
      "description": "Federal, state, and local laws and regulations affecting the production, processing, packaging, marketing, and distribution of food. Emphasis on FDA, USDA and California codes.",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_FSN 375",
      "course name": "Food Safety",
      "prerequisite": [
        "FSN 370"
      ],
      "units": "4 units",
      "term": [
        "Spring"
      ],
      "description": "Principles, practices, and regulations governing and ensuring the chemical, physical, and biological safety of the food supply. Topics include Hazard Analysis Critical Control Point ( HACCP ), risk assessment, import safety, food bioterrorism and defense, product recalls, and traceability.",
      "format": "3 lectures, 1 activity."
    },
    {
      "id": "CalPoly_FSN 400",
      "course name": "Special Problems for Advanced Undergraduates",
      "units": "1-4 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Individual investigation, research, studies, or surveys of selected problems. Total credit limited to 6 units, with a maximum of 4 units per quarter."
    },
    {
      "id": "CalPoly_FSN 401",
      "course name": "Advanced Enterprise Project",
      "prerequisite": [
        "FSN 201"
      ],
      "units": "1-4 units",
      "term": [
        "tbd"
      ],
      "description": "Leadership responsibility on enterprise projects. Lead students, under the supervision of instructor, will be accountable for all phases of the project : scheduling times, securing raw product, record keeping, and marketing of the product. Total degree credit for FSN201 and FSN401 combined",
      "grading": "limited to 12 units."
    },
    {
      "id": "CalPoly_FSN 408",
      "course name": "Food Product Development",
      "prerequisite": [
        "FSN 311",
        "FSN 368"
      ],
      "units": "4 units",
      "term": [
        "Fall",
        "Spring"
      ],
      "description": "Functionality of water, carbohydrates, proteins, lipids, additives and other food ingredients used in the formulation, development, and processing of foods. Product development processes from idea generation to marketing to consumer guided technical prototype development will be completed.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_FSN 410",
      "course name": "Nutritional Implications of Food Industry Practices",
      "prerequisite": [
        "FSN 210",
        "FSN 125 or FSN 230"
      ],
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "Methods for assessing nutritional quality of foods / diets. Nutrient databases for raw and processed foods. Effects of food industry practices ( e.g., processing, fortification, new product development, biotechnology ) on nutritional quality of foods / diets. Evolution of public policy.",
      "format": "4 seminars."
    },
    {
      "id": "CalPoly_FSN 415",
      "course name": "Nutrition Education and Communications",
      "units": "4 units",
      "term": [
        "Fall",
        "Spring"
      ],
      "description": "Application of appropriate behavior and learning theories in nutrition education and communications across diverse population groups. Effective use of techniques, materials, and computer - based technology to enhance communications. Includes community - based learning projects.",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_FSN 416",
      "course name": "Community Nutrition",
      "prerequisite": [
        "FSN 328"
      ],
      "units": "4 units",
      "term": [
        "Fall",
        "Spring"
      ],
      "description": "Federal, state and local nutrition assessment activities and program services. Emphasis on public health, health promotion and disease prevention. Development of skills in assessing community nutrition problems and planning community interventions.",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_FSN 417",
      "course name": "Nutrition Counseling",
      "prerequisite": [
        "PSY 201/202"
      ],
      "units": "4 units",
      "term": [
        "Winter",
        "Spring"
      ],
      "description": "Communication, behavioral, and counseling theories as they relate to nutrition counseling. Emphasis on development of skills to promote healthy eating behaviors. Examination of eating disorders and obesity, including preventative and therapeutic interventions.",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_FSN 420",
      "course name": "Critical Evaluation of Nutrition Research",
      "prerequisite": [
        "STAT 218"
      ],
      "units": "4 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Nutrition research terminology and methods. Critical evaluation and interpretation of nutrition research with emphasis on human studies of diet - health relationships. Evidence based review.",
      "format": "4 seminars."
    },
    {
      "id": "CalPoly_FSN 426",
      "course name": "Nutrition and Foodservice Systems Management",
      "prerequisite": [
        "FSN 344"
      ],
      "units": "4 units",
      "term": [
        "Fall",
        "Spring"
      ],
      "description": "Principles of successful organization and management with their application to the effective operation of clinical, community and foodservice systems. Administrative responsibilities of nutrition and foodservice directors. Management theories and practice. Labor relations. Discipline and performance appraisal.",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_FSN 429",
      "course name": "Clinical Nutrition I",
      "prerequisite": [
        "BIO 231 (ZOO 331 equivalent)",
        "BIO 232 (ZOO 332 equivalent)"
      ],
      "units": "4 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Application of the nutrition care process to physiological disorders which may alter nutritional requirements or require dietary modifications. Anthropometric, biochemical, clinical, and dietary assessment. Diabetes mellitus, electrolytes, acid - base balance, hydration and enteral and parenteral nutrition. Anemias, pharmacology, cardiovascular disease and obesity.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_FSN 430",
      "course name": "Clinical Nutrition II",
      "prerequisite": [
        "FSN 429"
      ],
      "units": "4 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Continuation of FSN429. Application of the nutrition care process to physiological and metabolic disorders which may alter nutritional requirements or require dietary modifications. GI disease, respiratory diseases, metabolic stress, burns, cancer, inborn errors of metabolism, cardiovascular disease, liver disease, and renal disease.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_FSN 440",
      "course name": "Internship",
      "units": "1-12 units",
      "term": [
        "tbd"
      ],
      "description": "Career experience with private or public agencies. Total credit limited to 12 units. Maximum of 6 units may be applied toward degree requirements."
    },
    {
      "id": "CalPoly_FSN 444",
      "course name": "Food Engineering",
      "prerequisite": [
        "FSN 204",
        "FSN 330"
      ],
      "units": "4 units",
      "term": [
        "Winter"
      ],
      "description": "Engineering principles governing heat transfer, fluid flow, and introductory mass transfer and application of these principles to selected unit operations ; theoretical aspects of the scientific and engineering principles of fluid flow and the transfer and change of materials and energy primarily by physical means during processing of food.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_FSN 461",
      "course name": "Senior Project I",
      "prerequisite": [
        "FSN 364",
        "STAT 218"
      ],
      "units": "3 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Selection of scientific research topic in major area. Development of literature review, research questions in Senior Project I. Research design, data collection, and analysis in Senior Project II. Project requires a formal report which must follow departmental guidelines. Minimum of 90 hours per quarter."
    },
    {
      "id": "CalPoly_FSN 462",
      "course name": "Senior Project II",
      "prerequisite": [
        "FSN 461"
      ],
      "units": "3 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Selection of scientific research topic in major area. Development of literature review, research questions in Senior Project I. Research design, data collection, and analysis in Senior Project II. Project requires a formal report which must follow departmental guidelines. Minimum of 90 hours per quarter."
    },
    {
      "id": "CalPoly_FSN 463",
      "course name": "Professional Practice in Nutrition and Dietetics",
      "units": "2 units",
      "term": [
        "cr/nc"
      ],
      "description": "Exploration of students ' transition to professional practice, career opportunities, and factors to be considered in career decisions. Application of strategic planning, critical thinking, written and oral communication skills in preparation for nutrition and dietetics professions.",
      "format": "2 lectures."
    },
    {
      "id": "CalPoly_FSN 470",
      "course name": "Selected Advanced Topics",
      "units": "1-4 units",
      "term": [
        "tbd"
      ],
      "description": "Directed group study of selected topics for advanced students. Open to undergraduate and graduate students. Class Schedule will list topic selected. Total credit",
      "grading": "limited to 8 units",
      "format": ". 1 - 4 lectures."
    },
    {
      "id": "CalPoly_FSN 471",
      "course name": "Selected Advanced Laboratory",
      "units": "1-4 units",
      "term": [
        "tbd"
      ],
      "description": "Directed group laboratory study of selected topics for advanced students. Open to undergraduate and graduate students. Class Schedule will list topic selected. Total credit",
      "grading": "limited to 8 units",
      "format": ". 1 - 4 laboratories."
    },
    {
      "id": "CalPoly_FSN 474",
      "course name": "Advanced Food Processing",
      "prerequisite": [
        "FSN 444"
      ],
      "units": "4 units",
      "term": [
        "Spring"
      ],
      "description": "Advanced topics in processing operations with emphasis on thermal processing. Non - traditional processing technology such as microwave, ionizing radiation, and high pressure.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_FSN 485",
      "course name": "Cooperative Education Experience in Food Science and Nutrition",
      "units": "6 units",
      "term": [
        "cr/nc"
      ],
      "description": "Part - time work experience with an approved Food Science or Nutrition firm engaged in production or related business, industry or governmental agency. Positions are paid and usually require relocation and registration in course for two consecutive quarters. Formal report and evaluation by work supervisor required. Total credit limited to 12 units. Degree credit limited to 6 units. Credit / No Credit grading only."
    },
    {
      "id": "CalPoly_FSN 495",
      "course name": "Cooperative Education Experience in Food Science and Nutrition",
      "units": "12 units",
      "term": [
        "cr/nc"
      ],
      "description": "Full time work experience with an approved Food Science or Nutrition firm engaged in production or related business, industry or governmental agency. Positions are paid and usually require relocation and registration in course for two consecutive quarters. Formal report and evaluation by work supervisor required. Total credit limited to 12 units. Degree credit limited to 6 units. Credit / No Credit grading only."
    },
    {
      "id": "CalPoly_FSN 500",
      "course name": "Individual Study",
      "units": "1-6 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Advanced independent study planned and completed under the direction of a member of the department faculty. Total credit",
      "grading": "limited to 6 units"
    },
    {
      "id": "CalPoly_FSN 501",
      "course name": "Lipid Metabolism and Nutrition",
      "units": "3 units",
      "term": [
        "tbd"
      ],
      "description": "Digestion, absorption and metabolism of lipids with emphasis on lipoprotein metabolism, regulation of lipid metabolism, effects of gene expression, essential fatty acid requirements and functions.",
      "format": "3 seminars."
    },
    {
      "id": "CalPoly_FSN 505",
      "course name": "Orientation to Food Science and Nutrition Graduate Studies",
      "units": "1 unit",
      "term": [
        "cr/nc"
      ],
      "description": "Orientation to and discussion of research interests in food science and nutrition. Discussion of policy and ethical issues in the conduct of research. Intended for entering graduate students in Food Science or Nutrition. Credit/ No Credit grading only. 1 seminar."
    },
    {
      "id": "CalPoly_FSN 508",
      "course name": "Food Product Innovation",
      "prerequisite": [
        "FSN 408"
      ],
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "Focus on product innovation strategies, project management, product life cycle, project development team management, product innovation metrics, process optimization and cost management. Plan and execute an industry - relevant specialized project.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_FSN 516",
      "course name": "Population Health and Epidemiology",
      "prerequisite": [
        "FSN 416"
      ],
      "units": "3 units",
      "term": [
        "Spring"
      ],
      "description": "Advanced concepts and issues in population health and epidemiology. Covers epidemiologic methods, study design, and conceptual frameworks from public health perspective. Analytical considerations related to population health will be presented. Emphasis on nutrition - related issues at national and global levels.",
      "format": "3 lectures."
    },
    {
      "id": "CalPoly_FSN 528",
      "course name": "Biochemical and Molecular Aspects of Human Macronutrient Metabolism",
      "prerequisite": [
        "FSN 328"
      ],
      "units": "4 units",
      "term": [
        "Winter"
      ],
      "description": "Advanced topics in the human metabolism of carbohydrates, lipids and proteins. Classic and recent findings related to mechanisms of nutrient - regulated gene expression. Metabolism related to specific diseases will also be covered.",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_FSN 529",
      "course name": "Metabolic and Molecular Aspects of Vitamins",
      "prerequisite": [
        "FSN 329"
      ],
      "units": "2 units",
      "term": [
        "Spring"
      ],
      "description": "Advanced topics in the molecular roles and functions of vitamins. Classic and recent findings related to mechanisms of vitamin - regulated gene expression. Specific aspects of vitamin deficiencies and toxicities will also be covered.",
      "format": "2 lectures."
    },
    {
      "id": "CalPoly_FSN 530",
      "course name": "Metabolic and Molecular Aspects of Minerals",
      "prerequisite": [
        "FSN 329"
      ],
      "units": "2 units",
      "term": [
        "Spring"
      ],
      "description": "Advanced topics in the molecular roles and functions of minerals. Classic and recent findings related to mechanisms of mineral - regulated gene expression. Specific aspects of mineral deficiencies and toxicities will also be covered.",
      "format": "2 lectures."
    },
    {
      "id": "CalPoly_FSN 541",
      "course name": "Dietetic Internship Seminar",
      "units": "2 units",
      "term": [
        "cr/nc"
      ],
      "description": "A forum for dietetic interns to make presentations and share their experiences in their supervised practice. Guest presentations on current issues in nutrition therapy, foodservice management and community nutrition. Total credit limited to 6 units, with a maximum of 2 units per quarter. Credit / No Credit grading only.",
      "format": "2 seminars."
    },
    {
      "id": "CalPoly_FSN 564",
      "course name": "Chemistry of Food Systems",
      "prerequisite": [
        "FSN 364 or graduate st"
      ],
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "Integration of food chemistry concepts to develop an in - depth understanding on the role of structural and functional properties of components in food systems. Research topics for components in specific food systems.",
      "format": "4 lectures."
    },
    {
      "id": "CalPoly_FSN 570",
      "course name": "Selected Topics in Food Science and Nutrition",
      "units": "1-4 units",
      "term": [
        "tbd"
      ],
      "description": "Directed group study of selected topics for advanced students. Open to undergraduate and graduate students. The Schedule of Classes will list title selected. Total credit",
      "grading": "limited to 12 units.",
      "format": "1 to 4 seminars."
    },
    {
      "id": "CalPoly_FSN 571",
      "course name": "Selected Advanced Laboratory in Food Science and Nutrition",
      "units": "1-4 units",
      "term": [
        "tbd"
      ],
      "description": "Directed group laboratory study of selected topics for advanced students. Open to undergraduate and graduate students. Class Schedule will list topic selected. Total credit",
      "grading": "limited to 8 units",
      "format": ". 1 - 4 laboratories."
    },
    {
      "id": "CalPoly_FSN 574",
      "course name": "Food Process Failure Analysis",
      "prerequisite": [
        "FSN 335 or graduate st",
        "FSN 444",
        "FSN 474"
      ],
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "Analysis of root causes and impacts of failure scenarios within the food industry. Corrective actions relative to safety, quality, and economics of the affected products will be assessed.",
      "format": "3 lectures, 1 activity."
    },
    {
      "id": "CalPoly_FSN 575",
      "course name": "Advanced Food Safety",
      "prerequisite": [
        "FSN 375 or graduate st",
        "MCRO 421"
      ],
      "units": "4 units",
      "term": [
        "tbd"
      ],
      "description": "In - depth analysis of food safety issues including outbreaks, risk assessment, Food Safety Modernization Act ( FSMA ), product and process assessments. Special emphasis on the critical evaluation, development and execution of food safety research.",
      "format": "3 lectures, 1 laboratory."
    },
    {
      "id": "CalPoly_FSN 581",
      "course name": "Graduate Seminar in Food Science and Nutrition",
      "units": "1-3 units",
      "term": [
        "tbd"
      ],
      "description": "Current findings and research problems in the field and their application to food science and nutrition. Class Schedule will list topic selected. Total credit limited to 6 units with approval of advisor.",
      "format": "1 - 3 seminars."
    },
    {
      "id": "CalPoly_FSN 599",
      "course name": "Thesis",
      "units": "1-6 units",
      "term": [
        "Fall",
        "Winter",
        "Spring"
      ],
      "description": "Individual research in food science and nutrition under faculty supervision leading to a graduate thesis of suitable quality. Total credit",
      "grading": "limited to 6 units"
    }
  ]
}