{
  "subjectOf": {
    "subject": "Health and Human Services Courses",
    "id": "HHS"
  },
  "providerOf": {
    "id": "AshFord",
    "university": "Ashford University",
    "hasSubject": "Health and Human Services Courses"
  },
  "courses": [
    {
      "id": "AshFord_HHS 201",
      "course name": "Introduction to Human Services",
      "units": "3 Credits",
      "description": "This course introduces students to the profession of health and human services beginning with the historical evolution of the field and continuing up to modern day. A broad-based view of the purpose, preparation, and theoretical orientation of the profession is stressed including the many types and career settings of human service professions, scope of work, and duties and functions. Basic skills required by health and human service workers are reviewed, in addition to the roles of human service workers in both clinical and non-clinical settings. An introductory examination of orientations, ethics, and skills related to health and human service delivery in diverse practice settings is included."
    },
    {
      "id": "AshFord_HHS 207",
      "course name": "Communication Skills for Health & Human Service Personnel",
      "units": "3 Credits",
      "description": "This course emphasizes theories and practice of professional communication skills within the context of health and human services. Students will examine classical approaches and new theories and research in interpersonal, and group communication. Active listening, empathy interviewing, nonverbal communication, and presentation skills are stressed. The impact of family, culture, and gender on communication is integrated through communication exercises and class projects. In this class, students will also have an opportunity to examine the practical implications of these concepts in developing their own communication skills through application of selected communication techniques and strategies."
    },
    {
      "id": "AshFord_HHS 310",
      "course name": "Health & Human Services Culture: The Helping Relationship",
      "units": "3 Credits",
      "description": "This course examines the role and function of helping, and helping processes as applied within the context of the health and human service profession. Helper characteristics are considered, relative to optimizing service delivery in diverse health and human service settings serving a multitude of constituents/client groups. Helping strategies and interventions, with attention to principles, methodology, practitioner skills and knowledge are overviewed. Interpretive strategies such as case study analysis, and vignette analysis are used to simulate health and human service settings."
    },
    {
      "id": "AshFord_HHS 320",
      "course name": "Cultural Awareness in the Human Services",
      "units": "3 Credits",
      "description": "This course prepares students to understand cultural systems, and the nature of cultural identity defined by gender, ethnicity, race, national origin, sexual orientation, income, physical and mental ability, age, and religion. Emphasis is placed on defining and developing skills for the culturally competent delivery of health and human services."
    },
    {
      "id": "AshFord_HHS 435",
      "course name": "Contemporary Issues, Trends, Health Law Ethics in Health & Human Services",
      "units": "3 Credits",
      "description": "Health and human service delivery practices are discussed using contemporary issues, trends, legal aspects, and ethics in an integrated approach. Health laws, ethics, and professional conduct standards including boundary- setting and confidentiality requirements are covered. Professional roles, functions, and legal/ethical responsibilities of health and human service professionals are overviewed using standards published by selected professional organizations."
    },
    {
      "id": "AshFord_HHS 460",
      "course name": "Research Methods in Health & Human Services",
      "units": "3 Credits",
      "description": "This course is a survey course encompassing the application of research methodology. It prepares students to critically evaluate published research. The nature and history of the scientific method, research tools, data collection and analysis will be reviewed. Although key statistical concepts are covered, the focus of the course is helping students gain a conceptual understanding of the components of sound research, and to understand the steps and procedures involved in ethical research of the content area."
    }
  ]
}