{
  "subjectOf": {
    "subject": "Homeland Security and Emergency Management Courses",
    "id": "HSM"
  },
  "providerOf": {
    "id": "AshFord",
    "university": "Ashford University",
    "hasSubject": "Homeland Security and Emergency Management Courses"
  },
  "courses": [
    {
      "id": "AshFord_HSM 101",
      "course name": "Introduction to Homeland Security & Emergency Management",
      "units": "3 Credits",
      "description": "This course is a broad overview of homeland security in the United States. Areas of study include the organizational structure of the Department of Homeland Security as well as the principals, foundations, and doctrines surrounding homeland security. Students examine both historical and current issues related to the creation of the Department of Homeland Security, current policies of the Department, and potential career paths within the department."
    },
    {
      "id": "AshFord_HSM 201",
      "course name": "Department of Homeland Security Missions & Current Issues",
      "units": "3 Credits",
      "description": "The course examines the Department of Homeland Security core missions; the reasoning behind the Department; the threats to America; and the current issues revolving around homeland security. In addition, students look at the various career opportunities in the Department of Homeland Security."
    },
    {
      "id": "AshFord_HSM 305",
      "course name": "Survey of Homeland Security & Emergency Management",
      "units": "3 Credits",
      "description": "This course is a broad overview of Homeland Security from its emergence in Americas first century to the 9/11 attacks. Areas of study include the rise of modern terrorism, domestic terrorism, cyberterrorism, Homeland Security organization, strategies, programs and principles, emergency management, the media, and the issues of civil liberties."
    },
    {
      "id": "AshFord_HSM 311",
      "course name": "Ethics & Homeland Security",
      "units": "3 Credits",
      "description": "This course provides a foundation of classical ethical theories and explores the ethical implications of war and terrorism in the 21st century. Students will be challenged to analyze the controversial issues of the practice of torture, bombing of civilians, assassination and targeted killing, and humanitarian intervention. Civil Liberties and the Patriot Act will be examined. Case studies will offer students the opportunity to examine their own moral stance on selected issues, and study the traditional ethical rules and practices in war, even when engaging with international terrorist groups."
    },
    {
      "id": "AshFord_HSM 315",
      "course name": "Emergency Planning",
      "units": "3 Credits",
      "description": "This course will provide students with the skills to develop a comprehensive plan for risk analysis, threat assessment, staffing an emergency operations center, coordinating with supporting agencies, and the creation of a continuing testing program. Actual case studies are used to teach students how to plan for natural disasters as well as terrorism at the federal, state and local levels."
    },
    {
      "id": "AshFord_HSM 320",
      "course name": "Emergency Response to Terrorism",
      "units": "3 Credits",
      "description": "This course is designed to provide students with the ability to evaluate an emergency incident, determine its scope, understand the function of the first responders, learn the communication procedures necessary to alert the appropriate agencies, and understand how first responders are dispatched. Students will create a recovery plan for response to large-scale terrorist incidents."
    },
    {
      "id": "AshFord_HSM 323",
      "course name": "Revolution & Terrorism in the Modern World",
      "units": "3 Credits",
      "description": "This course examines the ways revolution and terrorism has shaped the twenty-first century from an interdisciplinary perspective drawing on history, philosophy, and sociology. Emphasis is on the ideas and socio-historical forces that have produced revolutions."
    },
    {
      "id": "AshFord_HSM 421",
      "course name": "Research & Analysis in Homeland Security",
      "units": "3 Credits",
      "description": "Students will develop the skills to conduct research into selected topics relating to homeland security, emergency management and disaster preparedness using government websites, Internet sources, library databases, and other pertinent repositories of information and data. Students will be required to formulate a research topic with supporting sources for the final report due in the Capstone course."
    },
    {
      "id": "AshFord_HSM 433",
      "course name": "Counter Terrorism & Intelligence Analysis",
      "units": "3 Credits",
      "description": "Students in this course study and analyze counterterrorism including the evolution of counterterrorism, and the specifics of the typology and anatomy of terrorist operations. The course includes an overview of the intelligence community, collection, analysis, requirements and dissemination."
    },
    {
      "id": "AshFord_HSM 435",
      "course name": "Psychology of Disaster",
      "units": "3 Credits",
      "description": "Utilizing case studies and clinical research, the course will focus on the psychological and physiological response to natural disasters, terrorism, and other manmade disasters. Students will examine psychological reactions, the recovery process and mental health care for victims, disaster recovery teams, and first responders."
    },
    {
      "id": "AshFord_HSM 438",
      "course name": "Introduction to Cyber Crime",
      "units": "3 Credits",
      "description": "This course focuses on the technical aspects of digital crime as well as behavioral aspects of computer hackers, virus writers, terrorists and other offenders. Using real life examples and case studies, students will examine the history, development, extent and types of digital crime and digital terrorism as well as current legislation and law enforcement practices designed to prevent, investigate and prosecute these crimes."
    }
  ]
}