{
  "subjectOf": {
    "subject": "Management Courses",
    "id": "MGT"
  },
  "providerOf": {
    "id": "AshFord",
    "university": "Ashford University",
    "hasSubject": "Management Courses"
  },
  "courses": [
    {
      "id": "AshFord_MGT 300",
      "course name": "Supply Management",
      "units": "3 Credits",
      "description": "This course introduces the professional practice of supply management and its application to business.Students examine procurement, total cost of ownership, sustainability, and strategic partnerships in a global economy with different market structures. Students also evaluate negotiating and contracting to achieve organizational strategic objectives. Finally, students explore supply management careers."
    },
    {
      "id": "AshFord_MGT 302",
      "course name": "Foundations of Productions & Operations Management ",
      "units": "3 Credits",
      "description": "This course addresses the basic concepts of production and operations management, including the use of quantitative methods and analytical tool for forecasting, resource allocation, operations budgeting, capacity planning, project management, supply chain management, and quality assurance."
    },
    {
      "id": "AshFord_MGT 321",
      "course name": "Assessing Leadership Skills",
      "units": "3 Credits",
      "description": "This course introduces students to the concepts, skills, and strategies of personal/professional transformation that are the foundation of leading organizations in diverse communities. Topics include leadership assessment, developing personal vision, establishing a commitment to service, leading in complex communities, managing communication, and creating an environment of excellence."
    },
    {
      "id": "AshFord_MGT 322",
      "course name": "Principles of Logistics Management",
      "units": "3 Credits",
      "description": "This course introduces logistics/physical distribution and supply, and the related costs. It provides a systematic overview and analysis of the elements of logistics functions in widely varying types of industries and agencies, including handling, warehousing, inventory control, and financial controls."
    },
    {
      "id": "AshFord_MGT 323",
      "course name": "Principles of Supply Chain Management",
      "units": "3 Credits",
      "description": "This course introduces supply chain management, and the related costs. It provides a systematic overview and analysis of the elements of supply chain functions in widely varying types of industries and agencies, including handling, warehousing, inventory control, and financial controls.",
      "prerequisite": [
        "MGT 330"
      ]
    },
    {
      "id": "AshFord_MGT 325",
      "course name": "Introduction to Transportation Management",
      "units": "3 Credits",
      "description": "This course focuses on intermodal transportation as part of supply chain management. The course addresses the development of the global transportation system, transportation regulation, the modes of transportation and how they interface, shipper issues, intermodal transportation management, and the future in transportation.",
      "prerequisite": [
        "MGT 330"
      ]
    },
    {
      "id": "AshFord_MGT 330",
      "course name": "Management for Organizations",
      "units": "3 Credits",
      "description": "This course presents an introduction to management theory and practice, including the inter-relatedness that the planning, organizing, leading, and controlling functions play in the multicultural, technology-driven, and global organizations of the 21st century. The emphasis is on the application of management theory to real-life situations in the workplace."
    },
    {
      "id": "AshFord_MGT 370",
      "course name": "International Supply Chain Management",
      "units": "3 Credits",
      "description": "Topics covered in this course include the governments role in global logistics, the global logistics environment, ocean and air transportation, transportation to Canada, Mexico, and the European continent including intermediaries, documentation, insurance, exporting, and importing. Current trends in globalization will also be explored and evaluated. The role of logistics and transportation organizations in the global supply chain process will be discussed."
    },
    {
      "id": "AshFord_MGT 380",
      "course name": "Leadership for Organizations",
      "units": "3 Credits",
      "description": "Several leadership styles are examined in this course. Emphasis is placed on developing effectiveleadership in organizations and personal enterprises, and on developing ethical leadership perspectivesin personal and professional decision-making."
    },
    {
      "id": "AshFord_MGT 400",
      "course name": "Logistics Management",
      "units": "3 Credits",
      "description": "This course is an overview of logistics management in the modern business environment. It examines financial and economic aspects of logistics and highlights the value created by logistics activities. Students will evaluate transportation and warehousing management strategies. The course takes a practical approach to logistics and applies innovative logistics principles to business situations. The course examines contemporary topics, including the role of inventory, that support the organizations strategic goals.",
      "prerequisite": [
        "MGT 300"
      ]
    },
    {
      "id": "AshFord_MGT 401",
      "course name": "Hazardous Materials Management",
      "units": "3 Credits",
      "description": "This course addresses the significant issues associated with handling hazardous materials in a logisticalsystem. The course also provides a firm foundation on basic hazardous materials management principles.Topics include definitions of hazardous materials, regulatory overview, technology to treat different hazardous materials, and tracking and manifest rules.",
      "prerequisite": [
        "MGT 330"
      ]
    },
    {
      "id": "AshFord_MGT 415",
      "course name": "Group Behavior in Organizations",
      "units": "3 Credits",
      "description": "Theory and research are applied to the study of group dynamics, processes encountered in the small- group setting, and how organizational effectiveness is impacted by small-group and team functioning. The course focuses on group productivity, decision-making, diversity, group communication, resolving group conflict and building effective teams."
    },
    {
      "id": "AshFord_MGT 425",
      "course name": "Leadership & Motivation",
      "units": "3 Credits",
      "description": "This course examines various approaches to motivation and the design and implementation of motivational strategies for effective personal and organizational performance."
    },
    {
      "id": "AshFord_MGT 435",
      "course name": "Organizational Change",
      "units": "3 Credits",
      "description": "In this course, students will study and apply alternative theories, models and strategies for creating and managing organizational change. The effectiveness of management tools in initiating problem solving and decision making to bring about change within organizations is evaluated."
    },
    {
      "id": "AshFord_MGT 450",
      "course name": "Strategic Planning for Organizations",
      "units": "3 Credits",
      "description": "Strategic Planning introduces students to various management planning models and techniques, and applies these to actual business cases. This course stresses the concepts of both strategic planning and strategic management.",
      "prerequisite": [
        "MGT 330"
      ]
    },
    {
      "id": "AshFord_MGT 460",
      "course name": "Leadership Priorities & Practice",
      "units": "3 Credits",
      "description": "Leadership Priorities and Practice is a capstone course that requires students to reflect on and synthesize the major insights gained in their study of organizational management. A substantive paper is developed to illustrate how these insights can be applied effectively in the students work environment. Students choosing the personal program of study must show how their chosen concentration relates to organizational management and include insights from each academic area in their synthesis and application.",
      "prerequisite": [
        "GEN 499"
      ]
    },
    {
      "id": "AshFord_MGT 490",
      "course name": "Strategic Human Resources Planning",
      "units": "3 Credits",
      "description": "This course provides a link between the traditional human resources functions (recruiting, staffing, training, performance appraisals, labor relations, and compensation and benefits), strategic planning, and meeting long-range organizational goals and objectives.",
      "prerequisite": [
        "GEN 499"
      ]
    },
    {
      "id": "AshFord_MGT 492",
      "course name": "Strategic Management for the Multinational Enterprise Capstone",
      "units": "3 Credits",
      "description": "The final integrative course in the international business program integrates the basic business functions through strategic management principles. Comprehensive cases deal with global competition in complex changing environments within which the organization seeks to achieve a sustainable competitive advantage. Issues of strategy formulation and implementation are addressed.",
      "prerequisite": [
        "GEN 499"
      ]
    },
    {
      "id": "AshFord_MGT 496",
      "course name": "Strategic Warehouse Management",
      "units": "3 Credits",
      "description": "This course is an overview of the strategic role that the warehousing function plays in the modern logistics environment. Subjects include warehouse strategies, difference in government and non-government systems, layout and design, location, customer service, bar coding, material handling, and measuring warehouse productivity.",
      "prerequisite": [
        "GEN 499"
      ]
    },
    {
      "id": "AshFord_MGT 497",
      "course name": "Strategic Technology Planning for Organizations",
      "units": "3 Credits",
      "description": "In this capstone, students will integrate knowledge and practices explored in the Bachelor of Business Information Systems program core courses. The course examines how an organization can achieve competitive advantage through the strategic alignment of information systems with organizational goals, and provides an opportunity for students to develop an Information Technology Strategic Plan. The course includes use of case analysis and interactive assignments to address industry best practices and challenges in real-world applications of IT strategic planning concepts. ",
      "prerequisite": [
        "GEN 499"
      ]
    },
    {
      "id": "AshFord_MGT 601",
      "course name": "The Functions of Modern Management",
      "units": "3 Credits",
      "description": "This course serves to advance the knowledge of the functions of management, the underlying theories and literature associated with the management discipline, and build students understanding of the relationships across organizational and business functions. Students grapple with current management problems and emerging solutions applied in the context of the organization."
    }
  ]
}