{
  "subjectOf": {
    "subject": "Master Health Care Administration Courses",
    "id": "MHA"
  },
  "providerOf": {
    "id": "AshFord",
    "university": "Ashford University",
    "hasSubject": "Master Health Care Administration Courses"
  },
  "courses": [
    {
      "id": "AshFord_MHA 601",
      "course name": "Principles of Health Care Administration",
      "units": "3 Credits",
      "description": "The focus of this course is on the application of advanced organizational principles in complex health care environments. Organizational issues, administrative processes and applications are explored. The managerial perspectives of a mid-to senior healthcare administrator are emphasized."
    },
    {
      "id": "AshFord_MHA 605",
      "course name": "Business Intelligence ",
      "units": "3 Credits",
      "description": "Business Intelligence uses technology to transform and analyze data into presentable information for decision-making. Strategic planning is essential for sustainability and business intelligence tools help leaders make the decisions that will positively impact the bottom line.",
      "similarTo": [
        "CSUS_BHON 120"
      ]
    },
    {
      "id": "AshFord_MHA 610",
      "course name": "Introduction to Biostatistics",
      "units": "3 Credits",
      "description": "This course explores the application of fundamental statistical methods to the health care environment. Course content includes both descriptive and inferential methods including: data analysis, statistical estimation, regression analysis, analysis of variance, hypothesis testing and analysis of longitudinal data."
    },
    {
      "id": "AshFord_MHA 612",
      "course name": "Financial & Managerial Accounting",
      "units": "3 Credits",
      "description": "This course provides the foundation for integrating health care finance and managerial accounting. Opportunities for analyzing current and emerging health care financing trends are provided. Practical cost-benefit strategies used in planning, controlling and preparing internal and external reports are emphasized."
    },
    {
      "id": "AshFord_MHA 616",
      "course name": "Health Care Management Information Systems",
      "units": "3 Credits",
      "description": "This course applies health care data in real-world contexts. Factors such as service line identification, program planning, implementation models and outcome monitoring are covered."
    },
    {
      "id": "AshFord_MHA 618",
      "course name": "Health Economics",
      "units": "3 Credits",
      "description": "This course focuses upon the analysis of health care operations and planning decisions derived from the theoretical concepts of demand, cost production, profit and competition. External and internal forces challenging health care services are analyzed. Organizational effectiveness and efficiency within the complex health care environment are emphasized."
    },
    {
      "id": "AshFord_MHA 620",
      "course name": "Health Policy Analyses",
      "units": "3 Credits",
      "description": "This course focuses on the analysis and evaluation of health care policy. Policy implications in organizational decision-making, strategic planning and market positions are examined."
    },
    {
      "id": "AshFord_MHA 622",
      "course name": "Health Care Ethics & Law",
      "units": "3 Credits",
      "description": "This course focuses upon the legal and ethical issues arising in the health care environment. Case study analysis is used to illustrate the ethical and legal implications commonly addressed in health care."
    },
    {
      "id": "AshFord_MHA 624",
      "course name": "Continuous Quality Improvements & Risk Management",
      "units": "3 Credits",
      "description": "This course examines a systemic approach to health care outcomes and risk management practices. Assurance of quality health services and organizational risk control is discussed using industry benchmark and accreditation standards and processes."
    },
    {
      "id": "AshFord_MHA 626",
      "course name": "Strategic Planning & Marketing in Health Care",
      "units": "3 Credits",
      "description": "This course focuses upon the visioning and modeling of services and programs, both anticipatory and responsive, utilizing market-driven information. Students integrate theories from economics, information management, finance and leadership, culminating in the generation of a comprehensive business plan."
    },
    {
      "id": "AshFord_MHA 628",
      "course name": "Managed Care & Contractual Services",
      "units": "3 Credits",
      "description": "This course examines the concepts of supply, demand, profits, cost and quality control in a managed care environment. Stakeholder dynamics are explored. Factors such as population, health status, market forces, contractual adjustments, third-party payers, cost allocation, government policies, and legal and ethical implications are explored."
    },
    {
      "id": "AshFord_MHA 630",
      "course name": "Global & Population Health: Comparative Systems",
      "units": "3 Credits",
      "description": "Global health care needs continue to emerge as interchanges among peoples and nations increase. To effectively address these needs, health care administrators must understand the social, economic, environmental, and political determinants of health and be prepared to respond to challenges related to health and health care at the local, national, and global level. This course examines the historical evolution of global health challenges as well as the future trends that will continue to impact health and health systems worldwide."
    },
    {
      "id": "AshFord_MHA 690",
      "course name": "Health Care Capstone",
      "units": "3 Credits",
      "description": "This course offers an opportunity for the integration of knowledge and skills developed within a culminating student project. The focus is on strategic and organizational issues unique to the health care environment. The student will present a comprehensive report at the end of the Capstone experience."
    }
  ]
}